
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"螳螂军火爆炸", -- [1]
				"爪击", -- [2]
				"神圣震击", -- [3]
				"投掷盾牌", -- [4]
				"斜掠", -- [5]
				"缴械", -- [6]
				"吸取生命", -- [7]
				"痛苦诅咒", -- [8]
				"闪烁火焰", -- [9]
				"蜡质皮肤", -- [10]
				"大地震击", -- [11]
				"鲜血恐惧", -- [12]
				"冲锋", -- [13]
				"制裁之拳", -- [14]
				"蛮力猛击", -- [15]
				"恶毒之咬", -- [16]
				"穿刺", -- [17]
				"顺劈斩", -- [18]
				"嗜血", -- [19]
				"致命投掷", -- [20]
				"音波钩锁", -- [21]
				"精神鞭笞", -- [22]
				"翔龙在天", -- [23]
				"血腥打击", -- [24]
				"缠丝束缚", -- [25]
				"破甲", -- [26]
				"石爪", -- [27]
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["filt"] = {
			},
			["buffer"] = {
				["精神鞭笞"] = 0,
				["音波钩锁"] = 0,
				["致命投掷"] = 0,
				["鲜血恐惧"] = 0,
				["大地震击"] = 0,
				["螳螂军火爆炸"] = 0,
				["痛苦诅咒"] = 0,
				["投掷盾牌"] = 0,
				["翔龙在天"] = 0,
				["制裁之拳"] = 0,
				["神圣震击"] = 0,
				["破甲"] = 0,
				["恶毒之咬"] = 0,
				["嗜血"] = 0,
				["冲锋"] = 0,
				["蛮力猛击"] = 0,
				["顺劈斩"] = 0,
				["闪烁火焰"] = 0,
				["爪击"] = 0,
				["血腥打击"] = 0,
				["斜掠"] = 0,
				["石爪"] = 0,
				["缴械"] = 0,
				["穿刺"] = 0,
				["缠丝束缚"] = 0,
				["吸取生命"] = 0,
				["蜡质皮肤"] = 0,
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"狂暴", -- [1]
				"焦油", -- [2]
				"破碎的甲壳", -- [3]
				"密封甲壳", -- [4]
				"巢穴心智", -- [5]
				"狂乱攻击", -- [6]
				"狂风之力", -- [7]
				"烟雾弹", -- [8]
				"暴躁", -- [9]
				"激怒", -- [10]
				"不满的怒火", -- [11]
				"急速冲锋", -- [12]
				"逃命！", -- [13]
				"过载", -- [14]
				"粘丝护盾", -- [15]
				"潜行", -- [16]
				"疾跑", -- [17]
				"中等洞悉", -- [18]
				"初步洞悉", -- [19]
				"冲动", -- [20]
				"涂色芜菁", -- [21]
				"珊瑚蝮蛇徽章", -- [22]
				"切割", -- [23]
				"俯冲轰炸", -- [24]
				"突袭", -- [25]
				"钓鱼", -- [26]
				"死亡脚步", -- [27]
				"水流喷涌", -- [28]
				"嗜血", -- [29]
				"爆裂领主的毁灭瞄准镜", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["filt"] = {
			},
			["buffer"] = {
				["烧灼"] = 0,
				["强风冲击"] = 0,
				["践踏"] = 0,
				["凝视"] = 0,
				["毁灭之击"] = 0,
				["毁灭践踏"] = 0,
				["当头一脚"] = 0,
				["狂乱攻击"] = 0,
				["孟都之怒"] = 0,
				["愤怒之锤"] = 0,
				["解散宠物"] = 0,
				["投掷"] = 0,
				["射击"] = 0,
				["扔掷易爆之球"] = 0,
				["水流喷涌"] = 0,
				["雷霆"] = 0,
				["喂食蚕宝宝"] = 0,
				["钳爪"] = 0,
				["洒油"] = 0,
				["闪电箭"] = 0,
				["丢掷污泥"] = 0,
				["猛击"] = 0,
				["飞翼打击"] = 0,
				["雷霆扫击"] = 0,
				["冰水喷涌"] = 0,
				["大地践踏"] = 0,
				["毒液喷吐"] = 0,
				["重击头槌"] = 0,
				["断肢"] = 0,
				["突袭"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["filt"] = {
			},
			["buffer"] = {
				["敏捷思维"] = 0,
				["冷酷严冬"] = 0,
				["重伤"] = 0,
				["炽燃烟火"] = 0,
				["烈焰震击"] = 0,
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"射击", -- [1]
				"践踏", -- [2]
				"凝视", -- [3]
				"狂乱攻击", -- [4]
				"重击头槌", -- [5]
				"强风冲击", -- [6]
				"洒油", -- [7]
				"钳爪", -- [8]
				"猛击", -- [9]
				"闪电箭", -- [10]
				"烧灼", -- [11]
				"当头一脚", -- [12]
				"丢掷污泥", -- [13]
				"投掷", -- [14]
				"愤怒之锤", -- [15]
				"扔掷易爆之球", -- [16]
				"断肢", -- [17]
				"雷霆", -- [18]
				"大地践踏", -- [19]
				"毁灭践踏", -- [20]
				"飞翼打击", -- [21]
				"喂食蚕宝宝", -- [22]
				"突袭", -- [23]
				"毒液喷吐", -- [24]
				"水流喷涌", -- [25]
				"冰水喷涌", -- [26]
				"孟都之怒", -- [27]
				"雷霆扫击", -- [28]
				"解散宠物", -- [29]
				"毁灭之击", -- [30]
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["filt"] = {
			},
			["buffer"] = {
				["珊瑚蝮蛇徽章"] = 0,
				["潜行"] = 0,
				["急速冲锋"] = 0,
				["过载"] = 0,
				["爆裂领主的毁灭瞄准镜"] = 0,
				["初步洞悉"] = 0,
				["逃命！"] = 0,
				["密封甲壳"] = 0,
				["狂暴"] = 0,
				["巢穴心智"] = 0,
				["切割"] = 0,
				["暴躁"] = 0,
				["狂风之力"] = 0,
				["疾跑"] = 0,
				["水流喷涌"] = 0,
				["狂乱攻击"] = 0,
				["涂色芜菁"] = 0,
				["嗜血"] = 0,
				["激怒"] = 0,
				["不满的怒火"] = 0,
				["粘丝护盾"] = 0,
				["破碎的甲壳"] = 0,
				["中等洞悉"] = 0,
				["死亡脚步"] = 0,
				["冲动"] = 0,
				["焦油"] = 0,
				["钓鱼"] = 0,
				["烟雾弹"] = 0,
				["俯冲轰炸"] = 0,
				["突袭"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"敏捷思维", -- [1]
				"炽燃烟火", -- [2]
				"重伤", -- [3]
				"冷酷严冬", -- [4]
				"烈焰震击", -- [5]
			},
		},
		["PROFILE"] = {
		},
	},
}
