
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"震颤", -- [1]
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["filt"] = {
			},
			["buffer"] = {
				["震颤"] = 0,
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"巨龙之息", -- [1]
				"敏捷思维", -- [2]
				"血色保护", -- [3]
				"狂暴之怒", -- [4]
				"光明之刃", -- [5]
				"解除护甲", -- [6]
				"重型护甲", -- [7]
				"生命传导", -- [8]
				"盾牌屏障", -- [9]
				"狂信", -- [10]
				"烈焰风暴", -- [11]
				"异端裁决", -- [12]
				"命令怒吼", -- [13]
				"血之契印", -- [14]
				"方阵防御", -- [15]
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["filt"] = {
			},
			["buffer"] = {
				["火球术"] = 0,
				["神圣之火"] = 0,
				["投掷雕像"] = 0,
				["巨龙之息"] = 0,
				["火球"] = 0,
				["烈焰风暴"] = 0,
				["神圣惩击"] = 0,
				["光明之刃"] = 0,
				["焚烧书籍"] = 0,
				["炎爆术"] = 0,
				["连珠火球"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["filt"] = {
			},
			["buffer"] = {
				["活动炸弹"] = 0,
				["敏捷思维"] = 0,
				["冰冻"] = 0,
				["冲击波"] = 0,
				["炎爆术"] = 0,
				["重伤"] = 0,
				["冷酷严冬"] = 0,
				["点燃"] = 0,
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"巨龙之息", -- [1]
				"焚烧书籍", -- [2]
				"炎爆术", -- [3]
				"连珠火球", -- [4]
				"火球", -- [5]
				"投掷雕像", -- [6]
				"光明之刃", -- [7]
				"烈焰风暴", -- [8]
				"火球术", -- [9]
				"神圣之火", -- [10]
				"神圣惩击", -- [11]
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["filt"] = {
			},
			["buffer"] = {
				["异端裁决"] = 0,
				["敏捷思维"] = 0,
				["方阵防御"] = 0,
				["血之契印"] = 0,
				["狂信"] = 0,
				["巨龙之息"] = 0,
				["盾牌屏障"] = 0,
				["生命传导"] = 0,
				["解除护甲"] = 0,
				["烈焰风暴"] = 0,
				["狂暴之怒"] = 0,
				["重型护甲"] = 0,
				["光明之刃"] = 0,
				["血色保护"] = 0,
				["命令怒吼"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"敏捷思维", -- [1]
				"冲击波", -- [2]
				"冰冻", -- [3]
				"炎爆术", -- [4]
				"冷酷严冬", -- [5]
				"点燃", -- [6]
				"活动炸弹", -- [7]
				"重伤", -- [8]
			},
		},
		["PROFILE"] = {
		},
	},
}
