
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"充能暗影", -- [1]
				"巨人打击", -- [2]
				"荣耀圣令", -- [3]
				"虎跃", -- [4]
				"破体之噬", -- [5]
				"斜掠爪击", -- [6]
				"震颤", -- [7]
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["filt"] = {
			},
			["buffer"] = {
				["斜掠爪击"] = 0,
				["充能暗影"] = 0,
				["荣耀圣令"] = 0,
				["虎跃"] = 0,
				["破体之噬"] = 0,
				["巨人打击"] = 0,
				["震颤"] = 0,
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"辐射能量", -- [1]
				"过载", -- [2]
				"不稳定的能量", -- [3]
				"能量导管", -- [4]
				"静态熔焰", -- [5]
				"吸取能量", -- [6]
				"星界气息", -- [7]
				"典狱官的愤怒", -- [8]
				"纳拉克煞之触", -- [9]
				"群体攻击", -- [10]
				"不灭之影", -- [11]
				"凝聚暗影", -- [12]
				"时光波纹", -- [13]
				"时光护盾", -- [14]
				"闪现术", -- [15]
				"游学者徽章", -- [16]
				"赤色天灾", -- [17]
				"鲜血护盾", -- [18]
				"血之气息", -- [19]
				"势如破竹", -- [20]
				"符文腐蚀", -- [21]
				"佯攻", -- [22]
				"正义盾击", -- [23]
				"荣耀堡垒", -- [24]
				"吸血鬼之血", -- [25]
				"元素之誓", -- [26]
				"初步洞悉", -- [27]
				"炎爆术！", -- [28]
				"热力迸发", -- [29]
				"大十字军", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["filt"] = {
			},
			["buffer"] = {
				["能量符文"] = 0,
				["炎爆术"] = 0,
				["保护者显形"] = 0,
				["闪电吐息"] = 0,
				["火球术"] = 0,
				["神圣之火"] = 0,
				["霜火之箭"] = 0,
				["横扫千军"] = 0,
				["电弧能量"] = 0,
				["火焰新星"] = 0,
				["星界气息"] = 0,
				["灼烧"] = 0,
				["聚焦能量"] = 0,
				["快速治疗"] = 0,
				["纯粹能量"] = 0,
				["石化血肉"] = 0,
				["强效治疗波"] = 0,
				["强力横扫"] = 0,
				["元素冲击"] = 0,
				["闪电箭"] = 0,
				["惩击"] = 0,
				["氤氲之雾"] = 0,
				["治疗之雨"] = 0,
				["石块"] = 0,
				["寒冰炸弹"] = 0,
				["治疗祷言"] = 0,
				["治疗链"] = 0,
				["寒冰箭"] = 0,
				["熔岩爆裂"] = 0,
				["纳拉克煞之触"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["filt"] = {
			},
			["buffer"] = {
				["活动炸弹"] = 0,
				["敏捷思维"] = 0,
				["炎爆术"] = 0,
				["重伤"] = 0,
				["冰冻"] = 0,
				["炽热极速"] = 0,
				["冲击波"] = 0,
				["冷酷严冬"] = 0,
				["点燃"] = 0,
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"聚焦能量", -- [1]
				"横扫千军", -- [2]
				"电弧能量", -- [3]
				"保护者显形", -- [4]
				"星界气息", -- [5]
				"纯粹能量", -- [6]
				"强力横扫", -- [7]
				"纳拉克煞之触", -- [8]
				"石块", -- [9]
				"石化血肉", -- [10]
				"火焰新星", -- [11]
				"治疗祷言", -- [12]
				"灼烧", -- [13]
				"治疗链", -- [14]
				"炎爆术", -- [15]
				"强效治疗波", -- [16]
				"快速治疗", -- [17]
				"氤氲之雾", -- [18]
				"霜火之箭", -- [19]
				"能量符文", -- [20]
				"惩击", -- [21]
				"火球术", -- [22]
				"神圣之火", -- [23]
				"闪电箭", -- [24]
				"闪电吐息", -- [25]
				"熔岩爆裂", -- [26]
				"元素冲击", -- [27]
				"寒冰炸弹", -- [28]
				"寒冰箭", -- [29]
				"治疗之雨", -- [30]
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["filt"] = {
			},
			["buffer"] = {
				["过载"] = 0,
				["初步洞悉"] = 0,
				["辐射能量"] = 0,
				["荣耀堡垒"] = 0,
				["能量导管"] = 0,
				["赤色天灾"] = 0,
				["游学者徽章"] = 0,
				["纳拉克煞之触"] = 0,
				["群体攻击"] = 0,
				["不灭之影"] = 0,
				["星界气息"] = 0,
				["大十字军"] = 0,
				["时光护盾"] = 0,
				["势如破竹"] = 0,
				["静态熔焰"] = 0,
				["元素之誓"] = 0,
				["炎爆术！"] = 0,
				["符文腐蚀"] = 0,
				["鲜血护盾"] = 0,
				["不稳定的能量"] = 0,
				["吸血鬼之血"] = 0,
				["血之气息"] = 0,
				["吸取能量"] = 0,
				["正义盾击"] = 0,
				["典狱官的愤怒"] = 0,
				["热力迸发"] = 0,
				["佯攻"] = 0,
				["闪现术"] = 0,
				["凝聚暗影"] = 0,
				["时光波纹"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"炽热极速", -- [1]
				"敏捷思维", -- [2]
				"冲击波", -- [3]
				"冰冻", -- [4]
				"炎爆术", -- [5]
				"冷酷严冬", -- [6]
				"点燃", -- [7]
				"活动炸弹", -- [8]
				"重伤", -- [9]
			},
		},
		["PROFILE"] = {
		},
	},
}
