
AtlasLootDB = {
	["namespaces"] = {
		["DefaultFrame"] = {
			["profiles"] = {
				["岚黯 - 阿拉索"] = {
					["module"] = "AtlasLootWotLK",
					["NEWpoint"] = {
						nil, -- [1]
						nil, -- [2]
						"CENTER", -- [3]
						0, -- [4]
						2.196495140300183, -- [5]
					},
					["instance"] = "IcecrownCitadel",
				},
				["面面药铺 - 阿拉索"] = {
					["NEWpoint"] = {
						"RIGHT", -- [1]
						nil, -- [2]
						"RIGHT", -- [3]
						-106.3390542222589, -- [4]
						71.75164654246768, -- [5]
					},
				},
			},
		},
		["AtlasLootPanel"] = {
		},
		["WishList"] = {
		},
		["Filter"] = {
		},
	},
	["showWarning"] = true,
	["profileKeys"] = {
		["面面布料 - 阿拉索"] = "面面布料 - 阿拉索",
		["面面药铺 - 阿拉索"] = "面面药铺 - 阿拉索",
		["岚黯 - 阿拉索"] = "岚黯 - 阿拉索",
		["面面皮革 - 阿拉索"] = "面面皮革 - 阿拉索",
		["面面附魔 - 阿拉索"] = "面面附魔 - 阿拉索",
		["铭文面面 - 阿拉索"] = "铭文面面 - 阿拉索",
		["面面矿石 - 阿拉索"] = "面面矿石 - 阿拉索",
		["面面肉铺 - 阿拉索"] = "面面肉铺 - 阿拉索",
		["面面仓库 - 阿拉索"] = "面面仓库 - 阿拉索",
		["面面铭文 - 阿拉索"] = "面面铭文 - 阿拉索",
	},
	["profiles"] = {
		["面面布料 - 阿拉索"] = {
		},
		["面面药铺 - 阿拉索"] = {
		},
		["岚黯 - 阿拉索"] = {
			["LootTableType"] = "25ManHeroic",
		},
		["面面皮革 - 阿拉索"] = {
		},
		["面面附魔 - 阿拉索"] = {
		},
		["铭文面面 - 阿拉索"] = {
		},
		["面面矿石 - 阿拉索"] = {
		},
		["面面肉铺 - 阿拉索"] = {
		},
		["面面仓库 - 阿拉索"] = {
		},
		["面面铭文 - 阿拉索"] = {
		},
	},
}
