
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["buffer"] = {
				"闪电充能", -- [1]
				"破胆怒吼", -- [2]
				"责难", -- [3]
				"击退", -- [4]
				"精神鞭笞", -- [5]
				"穿刺护甲", -- [6]
				"毒液箭", -- [7]
				"痒", -- [8]
				"麻痹药膏", -- [9]
				"减速药膏", -- [10]
				"无力冲锋", -- [11]
				"头重脚轻", -- [12]
				"导致疯狂", -- [13]
				"大地震击", -- [14]
				"燃烧刺激", -- [15]
				"打击", -- [16]
				"顺劈斩", -- [17]
				"十字军打击", -- [18]
				"紫晶之池", -- [19]
				"毁灭打击", -- [20]
				"盾牌猛击", -- [21]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["buffer"] = {
				["精神鞭笞"] = 0,
				["头重脚轻"] = 0,
				["痒"] = 0,
				["减速药膏"] = 0,
				["大地震击"] = 0,
				["麻痹药膏"] = 0,
				["责难"] = 0,
				["击退"] = 0,
				["导致疯狂"] = 0,
				["破胆怒吼"] = 0,
				["打击"] = 0,
				["穿刺护甲"] = 0,
				["毒液箭"] = 0,
				["紫晶之池"] = 0,
				["顺劈斩"] = 0,
				["无力冲锋"] = 0,
				["燃烧刺激"] = 0,
				["十字军打击"] = 0,
				["盾牌猛击"] = 0,
				["毁灭打击"] = 0,
				["闪电充能"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["buffer"] = {
				"释放愤怒", -- [1]
				"辐射能量", -- [2]
				"过载", -- [3]
				"不稳定的能量", -- [4]
				"能量导管", -- [5]
				"吸取能量", -- [6]
				"静态熔焰", -- [7]
				"星界气息", -- [8]
				"重塑", -- [9]
				"典狱官的愤怒", -- [10]
				"纳拉克煞之触", -- [11]
				"隐秘行动", -- [12]
				"真实形态", -- [13]
				"坚固的石头", -- [14]
				"固石光环", -- [15]
				"狂乱之护", -- [16]
				"狂乱", -- [17]
				"烟雾弹", -- [18]
				"炽热极速", -- [19]
				"巨魔冲锋", -- [20]
				"极速奥能", -- [21]
				"废灵壁垒", -- [22]
				"引导火焰", -- [23]
				"震中", -- [24]
				"公正圣印", -- [25]
				"激怒", -- [26]
				"正义圣印", -- [27]
				"虔诚光环", -- [28]
				"战斗怒吼", -- [29]
				"自利", -- [30]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["buffer"] = {
				["强效治疗术"] = 0,
				["保护者显形"] = 0,
				["闪电吐息"] = 0,
				["炎爆术"] = 0,
				["引爆"] = 0,
				["无尽怒气"] = 0,
				["强化重塑"] = 0,
				["闪电之拳"] = 0,
				["星界气息"] = 0,
				["强力横扫"] = 0,
				["心灵震爆"] = 0,
				["聚焦能量"] = 0,
				["震中"] = 0,
				["纯粹能量"] = 0,
				["充实"] = 0,
				["横扫千军"] = 0,
				["眼棱"] = 0,
				["圣光闪现"] = 0,
				["碎石"] = 0,
				["红玉锁链"] = 0,
				["腐蚀酸液喷溅"] = 0,
				["渐燃之怒"] = 0,
				["沉默"] = 0,
				["暗影箭"] = 0,
				["释放愤怒"] = 0,
				["采集草药"] = 0,
				["横扫"] = 0,
				["沙尘爆裂"] = 0,
				["电弧能量"] = 0,
				["纳拉克煞之触"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["buffer"] = {
				["冰霜疫病"] = 0,
				["炽热极速"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["buffer"] = {
				"炽热极速", -- [1]
				"冰霜疫病", -- [2]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["buffer"] = {
				["狂乱"] = 0,
				["炽热极速"] = 0,
				["过载"] = 0,
				["极速奥能"] = 0,
				["虔诚光环"] = 0,
				["公正圣印"] = 0,
				["战斗怒吼"] = 0,
				["纳拉克煞之触"] = 0,
				["真实形态"] = 0,
				["正义圣印"] = 0,
				["吸取能量"] = 0,
				["坚固的石头"] = 0,
				["震中"] = 0,
				["典狱官的愤怒"] = 0,
				["重塑"] = 0,
				["狂乱之护"] = 0,
				["激怒"] = 0,
				["固石光环"] = 0,
				["自利"] = 0,
				["不稳定的能量"] = 0,
				["隐秘行动"] = 0,
				["静态熔焰"] = 0,
				["能量导管"] = 0,
				["引导火焰"] = 0,
				["释放愤怒"] = 0,
				["巨魔冲锋"] = 0,
				["废灵壁垒"] = 0,
				["烟雾弹"] = 0,
				["星界气息"] = 0,
				["辐射能量"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["buffer"] = {
				"释放愤怒", -- [1]
				"无尽怒气", -- [2]
				"渐燃之怒", -- [3]
				"聚焦能量", -- [4]
				"横扫千军", -- [5]
				"电弧能量", -- [6]
				"保护者显形", -- [7]
				"星界气息", -- [8]
				"强化重塑", -- [9]
				"强力横扫", -- [10]
				"纳拉克煞之触", -- [11]
				"纯粹能量", -- [12]
				"腐蚀酸液喷溅", -- [13]
				"红玉锁链", -- [14]
				"碎石", -- [15]
				"采集草药", -- [16]
				"引爆", -- [17]
				"炎爆术", -- [18]
				"震中", -- [19]
				"闪电之拳", -- [20]
				"眼棱", -- [21]
				"沉默", -- [22]
				"沙尘爆裂", -- [23]
				"横扫", -- [24]
				"心灵震爆", -- [25]
				"闪电吐息", -- [26]
				"暗影箭", -- [27]
				"强效治疗术", -- [28]
				"充实", -- [29]
				"圣光闪现", -- [30]
			},
			["filt"] = {
			},
		},
		["PROFILE"] = {
		},
	},
}
