
BagSyncDB = {
	["阿拉索"] = {
		["Karuta"] = {
			["bag"] = {
				{
					[17] = "37701,5",
				}, -- [1]
				{
					nil, -- [1]
					nil, -- [2]
					nil, -- [3]
					nil, -- [4]
					nil, -- [5]
					nil, -- [6]
					"18501", -- [7]
					"89612", -- [8]
					"80484", -- [9]
					"82807", -- [10]
					"79249,14", -- [11]
					"6948", -- [12]
					"77589,20", -- [13]
					"77589,16", -- [14]
					"40772", -- [15]
					"90146,9", -- [16]
					"77468,20", -- [17]
					"77468,2", -- [18]
					"77467,20", -- [19]
					"77467,6", -- [20]
					"72096,20", -- [21]
					"72096,10", -- [22]
					"89112,2", -- [23]
					"34068,5", -- [24]
				}, -- [2]
				{
					"20398", -- [1]
					"85580", -- [2]
					"8529,20", -- [3]
					"8529,20", -- [4]
					"8529,9", -- [5]
					"81401,2", -- [6]
					"81406,3", -- [7]
					"81409,6", -- [8]
					"81413,20", -- [9]
					"81413,20", -- [10]
					"81413,20", -- [11]
					"81410,20", -- [12]
					"81410,20", -- [13]
					"81410,20", -- [14]
					"81410,14", -- [15]
					"83079", -- [16]
					nil, -- [17]
					"18986", -- [18]
					"30544", -- [19]
					"82219", -- [20]
					"77546", -- [21]
					"76592", -- [22]
				}, -- [3]
				{
					"76575,2", -- [1]
					"76614", -- [2]
					"40768", -- [3]
					"48933", -- [4]
					"87215", -- [5]
					"74247", -- [6]
					"44128,4", -- [7]
					"76061", -- [8]
					"87579", -- [9]
					"77530", -- [10]
					nil, -- [11]
					"35275", -- [12]
					"45858", -- [13]
					"49040", -- [14]
					"87576", -- [15]
					"90906", -- [16]
					"34196", -- [17]
					"87570", -- [18]
					"87208,4", -- [19]
					"18564", -- [20]
				}, -- [4]
				[0] = {
					"39211,16", -- [1]
					"43013,16", -- [2]
					"44772,17", -- [3]
					"43012,12", -- [4]
					"44773,5", -- [5]
					"33568,20", -- [6]
					"33568,20", -- [7]
					"39212,2", -- [8]
					"33430", -- [9]
					"33568,20", -- [10]
					"33568", -- [11]
					[15] = "81249",
				},
			},
			["guild"] = "獨特魅儷",
			["gold"] = 8888655,
			["equip"] = {
				[0] = {
					"81237", -- [1]
					"81564", -- [2]
					"81698", -- [3]
					nil, -- [4]
					"81110", -- [5]
					"81085", -- [6]
					"81570", -- [7]
					"86749", -- [8]
					"81185", -- [9]
					"81277", -- [10]
					"89522", -- [11]
					"89522", -- [12]
					"81267", -- [13]
					"87574", -- [14]
					"81123", -- [15]
					"81693", -- [16]
				},
			},
			["class"] = "HUNTER",
			["faction"] = "Alliance",
			["mailbox"] = {
				[0] = {
				},
			},
		},
	},
}
BagSyncOpt = {
	["enableAuction"] = true,
	["showGuildNames"] = false,
	["tooltipOnlySearch"] = false,
	["enableTooltips"] = true,
	["enableMailbox"] = true,
	["enableFaction"] = true,
	["enableGuild"] = true,
	["dbversion"] = "7.1",
	["showTotal"] = true,
	["enableUnitClass"] = false,
	["enableMinimap"] = true,
}
BagSyncGUILD_DB = {
	["阿拉索"] = {
	},
}
BagSyncTOKEN_DB = {
	["阿拉索"] = {
		["正义点数"] = {
			["Karuta"] = 3164,
			["header"] = "地下城与团队",
			["icon"] = "Interface\\Icons\\pvecurrency-justice",
		},
		["征服点数"] = {
			["Karuta"] = 0,
			["header"] = "PvP",
			["icon"] = "Interface\\Icons\\PVPCurrency-Conquest-Alliance",
		},
		["勇气点数"] = {
			["Karuta"] = 1960,
			["header"] = "地下城与团队",
			["icon"] = "Interface\\Icons\\pvecurrency-valor",
		},
		["托尔巴拉德奖章"] = {
			["Karuta"] = 1,
			["header"] = "PvP",
			["icon"] = "Interface\\Icons\\achievement_zone_tolbarad",
		},
		["铁掌徽记"] = {
			["Karuta"] = 1,
			["header"] = "其它",
			["icon"] = "Interface\\Icons\\inv_relics_idolofferocity",
		},
		["荣誉点数"] = {
			["Karuta"] = 1841,
			["header"] = "PvP",
			["icon"] = "Interface\\Icons\\PVPCurrency-Honor-Alliance",
		},
		["冠军的徽记"] = {
			["Karuta"] = 12,
			["header"] = "其它",
			["icon"] = "Interface\\Icons\\Ability_Paladin_ArtofWar",
		},
		["世界之树的印记"] = {
			["Karuta"] = 23,
			["header"] = "其它",
			["icon"] = "Interface\\Icons\\inv_misc_markoftheworldtree",
		},
	},
}
BagSyncCRAFT_DB = {
	["阿拉索"] = {
		["Karuta"] = {
		},
	},
}
BagSyncBLACKLIST_DB = {
	["阿拉索"] = {
	},
}
