
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"破体之噬", -- [1]
				"审判", -- [2]
				"活动炸弹", -- [3]
				"宁神射击", -- [4]
				"法术反制", -- [5]
				"减速", -- [6]
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["filt"] = {
			},
			["buffer"] = {
				["活动炸弹"] = 0,
				["宁神射击"] = 0,
				["破体之噬"] = 0,
				["审判"] = 0,
				["法术反制"] = 0,
				["减速"] = 0,
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"烟雾弹", -- [1]
				"炽热极速", -- [2]
				"巨魔冲锋", -- [3]
				"极速奥能", -- [4]
				"废灵壁垒", -- [5]
				"野火灌注", -- [6]
				"引导火焰", -- [7]
				"震中", -- [8]
				"真实形态", -- [9]
				"坚固的石头", -- [10]
				"固石光环", -- [11]
				"狂乱之护", -- [12]
				"辐射能量", -- [13]
				"过载", -- [14]
				"不稳定的能量", -- [15]
				"能量导管", -- [16]
				"吸取能量", -- [17]
				"静态熔焰", -- [18]
				"星界气息", -- [19]
				"典狱官的愤怒", -- [20]
				"纳拉克煞之触", -- [21]
				"燃烧之怒", -- [22]
				"狩猎刺激", -- [23]
				"大地生命", -- [24]
				"野兽顺劈斩", -- [25]
				"疯乱", -- [26]
				"急奔", -- [27]
				"狂乱", -- [28]
				"征服召唤", -- [29]
				"镜面瞄准镜", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["filt"] = {
			},
			["buffer"] = {
				["引爆"] = 0,
				["保护者显形"] = 0,
				["闪电吐息"] = 0,
				["火球术"] = 0,
				["炎爆术"] = 0,
				["霜火之箭"] = 0,
				["闪电之拳"] = 0,
				["红玉锁链"] = 0,
				["眼镜蛇射击"] = 0,
				["阻碍猛刺"] = 0,
				["强力横扫"] = 0,
				["水箭"] = 0,
				["星涌术"] = 0,
				["震中"] = 0,
				["纯粹能量"] = 0,
				["石化血肉"] = 0,
				["氤氲之雾"] = 0,
				["星界气息"] = 0,
				["聚焦能量"] = 0,
				["碎石"] = 0,
				["寒冰炸弹"] = 0,
				["横扫千军"] = 0,
				["愤怒"] = 0,
				["寒冰箭"] = 0,
				["治疗波"] = 0,
				["鬼影缠身"] = 0,
				["治疗祷言"] = 0,
				["石块"] = 0,
				["电弧能量"] = 0,
				["纳拉克煞之触"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["filt"] = {
			},
			["buffer"] = {
				["炽热极速"] = 0,
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"引爆", -- [1]
				"炎爆术", -- [2]
				"火球术", -- [3]
				"震中", -- [4]
				"闪电之拳", -- [5]
				"红玉锁链", -- [6]
				"碎石", -- [7]
				"阻碍猛刺", -- [8]
				"聚焦能量", -- [9]
				"横扫千军", -- [10]
				"电弧能量", -- [11]
				"保护者显形", -- [12]
				"星界气息", -- [13]
				"纯粹能量", -- [14]
				"强力横扫", -- [15]
				"纳拉克煞之触", -- [16]
				"石块", -- [17]
				"石化血肉", -- [18]
				"氤氲之雾", -- [19]
				"寒冰箭", -- [20]
				"愤怒", -- [21]
				"寒冰炸弹", -- [22]
				"治疗波", -- [23]
				"闪电吐息", -- [24]
				"星涌术", -- [25]
				"治疗祷言", -- [26]
				"鬼影缠身", -- [27]
				"眼镜蛇射击", -- [28]
				"霜火之箭", -- [29]
				"水箭", -- [30]
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["filt"] = {
			},
			["buffer"] = {
				["过载"] = 0,
				["烟雾弹"] = 0,
				["狂乱"] = 0,
				["野兽顺劈斩"] = 0,
				["极速奥能"] = 0,
				["炽热极速"] = 0,
				["纳拉克煞之触"] = 0,
				["废灵壁垒"] = 0,
				["大地生命"] = 0,
				["引导火焰"] = 0,
				["真实形态"] = 0,
				["坚固的石头"] = 0,
				["震中"] = 0,
				["典狱官的愤怒"] = 0,
				["静态熔焰"] = 0,
				["狂乱之护"] = 0,
				["野火灌注"] = 0,
				["狩猎刺激"] = 0,
				["镜面瞄准镜"] = 0,
				["不稳定的能量"] = 0,
				["固石光环"] = 0,
				["吸取能量"] = 0,
				["能量导管"] = 0,
				["疯乱"] = 0,
				["急奔"] = 0,
				["巨魔冲锋"] = 0,
				["征服召唤"] = 0,
				["燃烧之怒"] = 0,
				["星界气息"] = 0,
				["辐射能量"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"炽热极速", -- [1]
			},
		},
		["PROFILE"] = {
		},
	},
}
