--[=[
	Language Localization: zhCN
	Translated by: name <email address>
]=]

if GetLocale() ~= "zhCN" then return end
local L = JPackLocale


L.TYPE_BAG = "容器"
L.TYPE_FISHWEAPON = "鱼竿"
L.TYPE_MISC = "其它"
L.TYPE_CONSUMABLE = "消耗品"
L.TYPE_YAOSHUI = "药水"
L.TYPE_FOODDRINK = "食物和饮料"
L.TYPE_WEAPON = "武器"
L.TYPE_HUJIA = "护甲"
L.TYPE_SHANGPIN = "商品"


-- #类别 ##子类别

JPACK_ORDER={"炉石","清心书卷","消魔尘","侏儒军刀","破雾护目镜","铜棒","符文铜棒","符文银棒","符文金棒","符文真银棒","符文奥金棒","符文魔铁棒","符文精金棒","符文恒金棒","符文源质棒","#商品##附魔道具","矿工锄","剥皮小刀","锤头锄","锋刃锄","珠宝制作工具","学者的书写工具","轻羊皮纸","#武器##鱼竿","垂钓翁捕鱼木筏","纳特的帽子","饱经风霜的渔帽","锐利的鱼钩","水下诱鱼器","明亮的小珠","夜色虫","达图尔的变形魔棒","辛多雷宝珠","狂心美酒","铁靴烈酒","诺格弗格药剂","欺诈宝珠","#消耗品##消耗品","#武器","#护甲","#商品##原料","#商品##装置","#商品##爆炸物","#商品##零件","#商品##元素","#商品##皮革","#商品##草药","#商品##金属和矿石","#商品##珠宝加工","#商品##附魔材料","#商品##护甲强化","#商品##武器强化","#商品##其它","#商品##布料","#消耗品##绷带","#商品##肉类","#商品##烹饪","#消耗品##食物和饮料","#消耗品##药水","#消耗品##药剂","#消耗品##合剂","#消耗品##卷轴","#消耗品##物品强化","#消耗品##其它","#雕文##战士","#雕文##圣骑士","#雕文##猎人","#雕文##盗贼","#雕文##牧师","#雕文##死亡骑士","#雕文##萨满祭司","#雕文##法师","#雕文##术士","#雕文##德鲁伊","#配方##书籍","#配方##制皮","#配方##裁缝","#配方##工程学","#配方##锻造","#配方##烹饪","#配方##炼金术","#配方##急救","#配方##附魔","#配方##钓鱼","#配方##珠宝加工","#珠宝##红色","#珠宝##橙色","#珠宝##黄色","#珠宝##绿色","#珠宝##蓝色","#珠宝##紫色","#珠宝##多彩","#珠宝##棱彩","#珠宝##简易","#容器##容器","#容器##灵魂袋","#容器##草药袋","#容器##附魔材料袋","#容器##工程学材料袋","#容器##宝石袋","#容器##矿石袋","#容器##制皮","#容器##铭文包","#其它##宠物","#其它##坐骑","#其它##节日","#其它##材料","#其它##垃圾","#其它##其它","#任务","#任务##任务","##垃圾"} 

-- 以下可根据角色名来分别定义：
if UnitName("player") == 'Jpack' then
JPACK_ORDER = {"Hearthstone","##Mounts"}
elseif UnitName("player") == 'Jpack' then
JPACK_ORDER = {"Hearthstone", "#Quest", "#Armor"}
end

-- 默认要存进银行的：
JPACK_DEPOSIT={}

-- 默认从银行取出的：
JPACK_DRAW={}

L["HELP"] = '输入"/jpack help"获取帮助.'
L["COMPLETE"] = "整理完毕..."
L["WARN"] = "请先拿掉你鼠标上的物品. 整理时不要抓起物品、金钱、法术."
L["Unknown command"] = "未知命令"

-- Help info
L["Slash command"] = "命令"
L["Pack"] = "整理"
L["Set sequence to ascend"] = "正序整理"
L["Set sequence to descend"] = "逆序整理"
L["Save to the bank"] = "保存到银行"
L["Load from the bank"] = "从银行取出"
L["Packup guildbank"] = "整理公会银行"
L["Print help info"] = "显示帮助"

L["Sequence"] = "整理顺序"
L["asc"] = "正序"
L["desc"] = "逆序"

L["Click"] = "点击"
L["Pack"] = "整理"

L["Alt + Left-Click"] = "Alt + 左键"
L["Shift + Left-Click"] = "Shift + 左键"
L["Ctrl + Left-Click"] = "Ctrl + 左键"
L["Shift + Right-Click"] = "Shift + 右键"
L["Ctrl + Right-Click"] = "Ctrl + 右键"
	
