
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["buffer"] = {
				"暗言术：痛", -- [1]
				"撕裂", -- [2]
				"冰枪术", -- [3]
				"法术吸取", -- [4]
				"法术反制", -- [5]
				"断筋", -- [6]
				"碾碎护甲", -- [7]
				"暗影打击", -- [8]
				"灵界打击", -- [9]
				"凛风冲击", -- [10]
				"冰霜打击", -- [11]
				"湮没", -- [12]
				"毒蛇钉刺", -- [13]
				"沉默射击", -- [14]
				"岩石弹幕", -- [15]
				"嗜血", -- [16]
				"英勇打击", -- [17]
				"元素诅咒", -- [18]
				"吸取生命", -- [19]
				"古尔丹之手", -- [20]
				"致死顺劈", -- [21]
				"追杀", -- [22]
				"腐蚀术", -- [23]
				"跳跃冲击", -- [24]
				"投掷盾牌", -- [25]
				"毁灭", -- [26]
				"斜掠", -- [27]
				"死亡之握", -- [28]
				"影袭", -- [29]
				"痛苦诅咒", -- [30]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["buffer"] = {
				["吸取生命"] = 0,
				["法术吸取"] = 0,
				["灵界打击"] = 0,
				["法术反制"] = 0,
				["湮没"] = 0,
				["沉默射击"] = 0,
				["投掷盾牌"] = 0,
				["跳跃冲击"] = 0,
				["死亡之握"] = 0,
				["痛苦诅咒"] = 0,
				["凛风冲击"] = 0,
				["古尔丹之手"] = 0,
				["暗影打击"] = 0,
				["英勇打击"] = 0,
				["冰霜打击"] = 0,
				["碾碎护甲"] = 0,
				["嗜血"] = 0,
				["毒蛇钉刺"] = 0,
				["元素诅咒"] = 0,
				["影袭"] = 0,
				["腐蚀术"] = 0,
				["追杀"] = 0,
				["暗言术：痛"] = 0,
				["斜掠"] = 0,
				["岩石弹幕"] = 0,
				["致死顺劈"] = 0,
				["冰枪术"] = 0,
				["断筋"] = 0,
				["毁灭"] = 0,
				["撕裂"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["buffer"] = {
				"俯冲轰炸", -- [1]
				"兽群领袖", -- [2]
				"魔性征召", -- [3]
				"恶魔重生", -- [4]
				"恶魔学识大师", -- [5]
				"黑暗灵魂：学识", -- [6]
				"风歌", -- [7]
				"元素光环", -- [8]
				"熔火之心", -- [9]
				"掠夺", -- [10]
				"亮纹", -- [11]
				"异种真菌", -- [12]
				"献祭光环", -- [13]
				"生命收割", -- [14]
				"石头穴居人之网", -- [15]
				"神圣之星", -- [16]
				"秩序之光", -- [17]
				"胜利", -- [18]
				"激怒", -- [19]
				"嗜血", -- [20]
				"乱舞", -- [21]
				"大地之盾", -- [22]
				"绞肉机", -- [23]
				"剑刃风暴", -- [24]
				"迅捷幽灵狮鹫", -- [25]
				"奥术光辉", -- [26]
				"闪现术", -- [27]
				"愤怒风暴", -- [28]
				"智力", -- [29]
				"奥术强化", -- [30]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["buffer"] = {
				["穴居人的重击"] = 0,
				["投掷长矛"] = 0,
				["恐惧"] = 0,
				["召唤愤怒卫士"] = 0,
				["孢子之云"] = 0,
				["霜火之箭"] = 0,
				["星涌术"] = 0,
				["变形术"] = 0,
				["大地之箭"] = 0,
				["熔岩喷溅"] = 0,
				["水箭"] = 0,
				["雷霆践踏"] = 0,
				["寒冰箭"] = 0,
				["灵魂之火"] = 0,
				["投掷岩石"] = 0,
				["蛛网喷涌"] = 0,
				["采集草药"] = 0,
				["大地之刺"] = 0,
				["心灵震爆"] = 0,
				["寒冰炸弹"] = 0,
				["猛击"] = 0,
				["愤怒"] = 0,
				["星火术"] = 0,
				["异种真菌"] = 0,
				["暗影箭"] = 0,
				["岩石气息"] = 0,
				["火焰箭"] = 0,
				["制造治疗石"] = 0,
				["射击"] = 0,
				["闪电吐息"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["buffer"] = {
				["寒冰护体"] = 0,
				["冰霜疫病"] = 0,
				["血之疫病"] = 0,
				["奥术光辉"] = 0,
				["寒冰锁链"] = 0,
				["献祭"] = 0,
				["冰冷智慧"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["buffer"] = {
				"寒冰护体", -- [1]
				"冰冷智慧", -- [2]
				"奥术光辉", -- [3]
				"寒冰锁链", -- [4]
				"献祭", -- [5]
				"血之疫病", -- [6]
				"冰霜疫病", -- [7]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["buffer"] = {
				["乱舞"] = 0,
				["秩序之光"] = 0,
				["奥术光辉"] = 0,
				["智力"] = 0,
				["迅捷幽灵狮鹫"] = 0,
				["绞肉机"] = 0,
				["风歌"] = 0,
				["魔性征召"] = 0,
				["闪现术"] = 0,
				["胜利"] = 0,
				["激怒"] = 0,
				["黑暗灵魂：学识"] = 0,
				["献祭光环"] = 0,
				["剑刃风暴"] = 0,
				["奥术强化"] = 0,
				["元素光环"] = 0,
				["嗜血"] = 0,
				["恶魔重生"] = 0,
				["亮纹"] = 0,
				["愤怒风暴"] = 0,
				["石头穴居人之网"] = 0,
				["异种真菌"] = 0,
				["兽群领袖"] = 0,
				["神圣之星"] = 0,
				["掠夺"] = 0,
				["大地之盾"] = 0,
				["生命收割"] = 0,
				["熔火之心"] = 0,
				["恶魔学识大师"] = 0,
				["俯冲轰炸"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["buffer"] = {
				"蛛网喷涌", -- [1]
				"射击", -- [2]
				"岩石气息", -- [3]
				"制造治疗石", -- [4]
				"心灵震爆", -- [5]
				"孢子之云", -- [6]
				"变形术", -- [7]
				"水箭", -- [8]
				"投掷长矛", -- [9]
				"霜火之箭", -- [10]
				"闪电吐息", -- [11]
				"星火术", -- [12]
				"星涌术", -- [13]
				"愤怒", -- [14]
				"猛击", -- [15]
				"熔岩喷溅", -- [16]
				"大地之箭", -- [17]
				"大地之刺", -- [18]
				"雷霆践踏", -- [19]
				"投掷岩石", -- [20]
				"寒冰箭", -- [21]
				"寒冰炸弹", -- [22]
				"异种真菌", -- [23]
				"穴居人的重击", -- [24]
				"采集草药", -- [25]
				"召唤愤怒卫士", -- [26]
				"暗影箭", -- [27]
				"灵魂之火", -- [28]
				"恐惧", -- [29]
				"火焰箭", -- [30]
			},
			["filt"] = {
			},
		},
		["PROFILE"] = {
		},
	},
}
