
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["buffer"] = {
				"贯日击", -- [1]
				"幽灵狼跳跃", -- [2]
				"神圣震击", -- [3]
				"闪电充能", -- [4]
				"英勇打击", -- [5]
				"死亡之握", -- [6]
				"跳跃冲击", -- [7]
				"投掷盾牌", -- [8]
				"快速攻击", -- [9]
				"利刃冲锋", -- [10]
				"震颤", -- [11]
				"水泡喷溅", -- [12]
				"荣耀圣令", -- [13]
				"炼狱冲击", -- [14]
				"凿击", -- [15]
				"暗影之刃副手", -- [16]
				"暗影之刃", -- [17]
				"元素释放", -- [18]
				"捅你！", -- [19]
				"螳螂军火爆炸", -- [20]
				"活动炸弹", -- [21]
				"驱散射击", -- [22]
				"致死打击", -- [23]
				"创裂", -- [24]
				"冲锋", -- [25]
				"虚空之盾", -- [26]
				"刺穿血肉", -- [27]
				"狼吞虎咽", -- [28]
				"强力踢击", -- [29]
				"破甲", -- [30]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["buffer"] = {
				["活动炸弹"] = 0,
				["死亡之握"] = 0,
				["跳跃冲击"] = 0,
				["捅你！"] = 0,
				["凿击"] = 0,
				["刺穿血肉"] = 0,
				["投掷盾牌"] = 0,
				["震颤"] = 0,
				["致死打击"] = 0,
				["创裂"] = 0,
				["荣耀圣令"] = 0,
				["利刃冲锋"] = 0,
				["虚空之盾"] = 0,
				["神圣震击"] = 0,
				["闪电充能"] = 0,
				["强力踢击"] = 0,
				["快速攻击"] = 0,
				["冲锋"] = 0,
				["破甲"] = 0,
				["幽灵狼跳跃"] = 0,
				["水泡喷溅"] = 0,
				["炼狱冲击"] = 0,
				["暗影之刃"] = 0,
				["驱散射击"] = 0,
				["英勇打击"] = 0,
				["元素释放"] = 0,
				["暗影之刃副手"] = 0,
				["狼吞虎咽"] = 0,
				["螳螂军火爆炸"] = 0,
				["贯日击"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["buffer"] = {
				"粘丝护盾", -- [1]
				"西瓜炸弹", -- [2]
				"战争艺术", -- [3]
				"法网恢恢", -- [4]
				"辐射能量", -- [5]
				"不稳定的能量", -- [6]
				"过载", -- [7]
				"能量导管", -- [8]
				"静态熔焰", -- [9]
				"吸取能量", -- [10]
				"星界气息", -- [11]
				"典狱官的愤怒", -- [12]
				"纳拉克煞之触", -- [13]
				"寒冰屏障", -- [14]
				"圣光回响", -- [15]
				"天神祝福", -- [16]
				"怒火释放", -- [17]
				"生命释放", -- [18]
				"敏捷", -- [19]
				"野兽顺劈斩", -- [20]
				"狂乱", -- [21]
				"先祖活力", -- [22]
				"群体攻击", -- [23]
				"树皮防护雕文", -- [24]
				"树皮术", -- [25]
				"召唤末日守卫", -- [26]
				"英勇", -- [27]
				"盛放", -- [28]
				"风歌", -- [29]
				"狂野怒火", -- [30]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["buffer"] = {
				["强效鹤翼铭文"] = 0,
				["香烤野雉"] = 0,
				["保护者显形"] = 0,
				["纳拉克煞之触"] = 0,
				["火焰新星"] = 0,
				["电弧能量"] = 0,
				["梦幻墨水"] = 0,
				["星耀墨水"] = 0,
				["厄运箭"] = 0,
				["横扫千军"] = 0,
				["阻碍猛刺"] = 0,
				["强力横扫"] = 0,
				["人参茶"] = 0,
				["星涌术"] = 0,
				["治疗波"] = 0,
				["纯粹能量"] = 0,
				["石化血肉"] = 0,
				["圣光普照"] = 0,
				["惩击"] = 0,
				["寒冰炸弹"] = 0,
				["复活宠物"] = 0,
				["传送：奥格瑞玛"] = 0,
				["飞翼打击"] = 0,
				["治疗之触"] = 0,
				["鱼饼"] = 0,
				["聚焦能量"] = 0,
				["圣言术：佑"] = 0,
				["石块"] = 0,
				["星界气息"] = 0,
				["炉石"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["buffer"] = {
				["冰霜疫病"] = 0,
				["激流"] = 0,
				["奥术光辉"] = 0,
				["重伤"] = 0,
				["寒冰护体"] = 0,
				["枭兽狂乱"] = 0,
				["冰冷智慧"] = 0,
				["灵魂之盾"] = 0,
				["自然的优雅"] = 0,
				["血之疫病"] = 0,
				["力量祝福"] = 0,
				["真言术：韧"] = 0,
				["冰霜之环"] = 0,
				["虚空风暴"] = 0,
				["反射之盾"] = 0,
				["野性印记"] = 0,
				["献祭"] = 0,
				["复仇之力"] = 0,
				["雷电之王的力量"] = 0,
				["寒冰锁链"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["buffer"] = {
				"反射之盾", -- [1]
				"冰霜之环", -- [2]
				"虚空风暴", -- [3]
				"重伤", -- [4]
				"激流", -- [5]
				"复仇之力", -- [6]
				"力量祝福", -- [7]
				"野性印记", -- [8]
				"枭兽狂乱", -- [9]
				"真言术：韧", -- [10]
				"自然的优雅", -- [11]
				"雷电之王的力量", -- [12]
				"灵魂之盾", -- [13]
				"寒冰护体", -- [14]
				"冰冷智慧", -- [15]
				"奥术光辉", -- [16]
				"寒冰锁链", -- [17]
				"献祭", -- [18]
				"血之疫病", -- [19]
				"冰霜疫病", -- [20]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["buffer"] = {
				["过载"] = 0,
				["典狱官的愤怒"] = 0,
				["怒火释放"] = 0,
				["狂乱"] = 0,
				["野兽顺劈斩"] = 0,
				["战争艺术"] = 0,
				["辐射能量"] = 0,
				["风歌"] = 0,
				["生命释放"] = 0,
				["群体攻击"] = 0,
				["盛放"] = 0,
				["西瓜炸弹"] = 0,
				["寒冰屏障"] = 0,
				["先祖活力"] = 0,
				["召唤末日守卫"] = 0,
				["静态熔焰"] = 0,
				["树皮术"] = 0,
				["树皮防护雕文"] = 0,
				["圣光回响"] = 0,
				["狂野怒火"] = 0,
				["不稳定的能量"] = 0,
				["粘丝护盾"] = 0,
				["法网恢恢"] = 0,
				["吸取能量"] = 0,
				["敏捷"] = 0,
				["能量导管"] = 0,
				["天神祝福"] = 0,
				["英勇"] = 0,
				["星界气息"] = 0,
				["纳拉克煞之触"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["buffer"] = {
				"飞翼打击", -- [1]
				"香烤野雉", -- [2]
				"炉石", -- [3]
				"梦幻墨水", -- [4]
				"星耀墨水", -- [5]
				"传送：奥格瑞玛", -- [6]
				"人参茶", -- [7]
				"强效鹤翼铭文", -- [8]
				"鱼饼", -- [9]
				"阻碍猛刺", -- [10]
				"横扫千军", -- [11]
				"聚焦能量", -- [12]
				"电弧能量", -- [13]
				"保护者显形", -- [14]
				"星界气息", -- [15]
				"纯粹能量", -- [16]
				"强力横扫", -- [17]
				"纳拉克煞之触", -- [18]
				"石块", -- [19]
				"石化血肉", -- [20]
				"治疗波", -- [21]
				"惩击", -- [22]
				"圣言术：佑", -- [23]
				"厄运箭", -- [24]
				"火焰新星", -- [25]
				"复活宠物", -- [26]
				"圣光普照", -- [27]
				"星涌术", -- [28]
				"治疗之触", -- [29]
				"寒冰炸弹", -- [30]
			},
			["filt"] = {
			},
		},
		["PROFILE"] = {
		},
	},
}
