
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["buffer"] = {
				"充能暗影", -- [1]
				"瀑流", -- [2]
				"湮没", -- [3]
				"致死打击", -- [4]
				"冲锋", -- [5]
				"英勇投掷", -- [6]
				"燃烧突袭", -- [7]
				"库尔提克打击", -- [8]
				"冰枪术", -- [9]
				"虚空风暴", -- [10]
				"迷踪步", -- [11]
				"柔韧的树脂", -- [12]
				"煞能尖啸", -- [13]
				"虚弱之触", -- [14]
				"死亡之握", -- [15]
				"灭杀", -- [16]
				"暗影步", -- [17]
				"锯齿利刃", -- [18]
				"毁灭", -- [19]
				"水泡喷溅", -- [20]
				"投掷火炬", -- [21]
				"舞空脚", -- [22]
				"撕裂肉体", -- [23]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["buffer"] = {
				["致死打击"] = 0,
				["充能暗影"] = 0,
				["死亡之握"] = 0,
				["湮没"] = 0,
				["灭杀"] = 0,
				["英勇投掷"] = 0,
				["煞能尖啸"] = 0,
				["虚弱之触"] = 0,
				["瀑流"] = 0,
				["库尔提克打击"] = 0,
				["燃烧突袭"] = 0,
				["撕裂肉体"] = 0,
				["迷踪步"] = 0,
				["水泡喷溅"] = 0,
				["虚空风暴"] = 0,
				["暗影步"] = 0,
				["投掷火炬"] = 0,
				["舞空脚"] = 0,
				["锯齿利刃"] = 0,
				["冰枪术"] = 0,
				["柔韧的树脂"] = 0,
				["毁灭"] = 0,
				["冲锋"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["buffer"] = {
				"狂乱", -- [1]
				"烟雾弹", -- [2]
				"炽热极速", -- [3]
				"巨魔冲锋", -- [4]
				"极速奥能", -- [5]
				"废灵壁垒", -- [6]
				"引导火焰", -- [7]
				"震中", -- [8]
				"真实形态", -- [9]
				"坚固的石头", -- [10]
				"固石光环", -- [11]
				"狂乱之护", -- [12]
				"辐射能量", -- [13]
				"不稳定的能量", -- [14]
				"过载", -- [15]
				"能量导管", -- [16]
				"静态熔焰", -- [17]
				"吸取能量", -- [18]
				"星界气息", -- [19]
				"典狱官的愤怒", -- [20]
				"纳拉克煞之触", -- [21]
				"寒冰屏障", -- [22]
				"圣光回响", -- [23]
				"怒火释放", -- [24]
				"飞刃", -- [25]
				"生命释放", -- [26]
				"敏捷", -- [27]
				"野兽顺劈斩", -- [28]
				"先祖活力", -- [29]
				"群体攻击", -- [30]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["buffer"] = {
				["保护者显形"] = 0,
				["闪电之拳"] = 0,
				["火球术"] = 0,
				["烧尽"] = 0,
				["引爆"] = 0,
				["复活宠物"] = 0,
				["炎爆术"] = 0,
				["火焰新星"] = 0,
				["烈焰风暴"] = 0,
				["强力横扫"] = 0,
				["电弧能量"] = 0,
				["聚焦能量"] = 0,
				["震中"] = 0,
				["纯粹能量"] = 0,
				["石化血肉"] = 0,
				["圣光普照"] = 0,
				["暗影冲击"] = 0,
				["闪电箭"] = 0,
				["碎石"] = 0,
				["红玉锁链"] = 0,
				["厄运箭"] = 0,
				["横扫千军"] = 0,
				["惩击"] = 0,
				["治疗波"] = 0,
				["暗影箭"] = 0,
				["阻碍猛刺"] = 0,
				["圣言术：佑"] = 0,
				["石块"] = 0,
				["星界气息"] = 0,
				["纳拉克煞之触"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["buffer"] = {
				["重塑"] = 0,
				["加速"] = 0,
				["反射之盾"] = 0,
				["激怒"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["buffer"] = {
				"反射之盾", -- [1]
				"加速", -- [2]
				"激怒", -- [3]
				"重塑", -- [4]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["buffer"] = {
				["狂乱"] = 0,
				["纳拉克煞之触"] = 0,
				["野兽顺劈斩"] = 0,
				["极速奥能"] = 0,
				["过载"] = 0,
				["先祖活力"] = 0,
				["怒火释放"] = 0,
				["生命释放"] = 0,
				["群体攻击"] = 0,
				["真实形态"] = 0,
				["坚固的石头"] = 0,
				["寒冰屏障"] = 0,
				["震中"] = 0,
				["引导火焰"] = 0,
				["静态熔焰"] = 0,
				["狂乱之护"] = 0,
				["典狱官的愤怒"] = 0,
				["固石光环"] = 0,
				["能量导管"] = 0,
				["不稳定的能量"] = 0,
				["辐射能量"] = 0,
				["飞刃"] = 0,
				["吸取能量"] = 0,
				["敏捷"] = 0,
				["圣光回响"] = 0,
				["巨魔冲锋"] = 0,
				["废灵壁垒"] = 0,
				["烟雾弹"] = 0,
				["星界气息"] = 0,
				["炽热极速"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["buffer"] = {
				"暗影箭", -- [1]
				"火球术", -- [2]
				"引爆", -- [3]
				"炎爆术", -- [4]
				"震中", -- [5]
				"闪电之拳", -- [6]
				"红玉锁链", -- [7]
				"碎石", -- [8]
				"阻碍猛刺", -- [9]
				"横扫千军", -- [10]
				"聚焦能量", -- [11]
				"电弧能量", -- [12]
				"保护者显形", -- [13]
				"星界气息", -- [14]
				"纯粹能量", -- [15]
				"强力横扫", -- [16]
				"纳拉克煞之触", -- [17]
				"石块", -- [18]
				"石化血肉", -- [19]
				"治疗波", -- [20]
				"暗影冲击", -- [21]
				"惩击", -- [22]
				"圣言术：佑", -- [23]
				"厄运箭", -- [24]
				"火焰新星", -- [25]
				"烈焰风暴", -- [26]
				"闪电箭", -- [27]
				"复活宠物", -- [28]
				"圣光普照", -- [29]
				"烧尽", -- [30]
			},
			["filt"] = {
			},
		},
		["PROFILE"] = {
		},
	},
}
