
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["buffer"] = {
				"冲刺", -- [1]
				"蛛网", -- [2]
				"野蛮打击", -- [3]
				"血晕", -- [4]
				"撕裂肉体", -- [5]
				"吸血诅咒", -- [6]
				"吸血冲锋", -- [7]
				"魔法增效", -- [8]
				"吸血鬼打击", -- [9]
				"毒脓", -- [10]
				"变形辐射", -- [11]
				"暗影顺劈", -- [12]
				"蛛网裹体", -- [13]
				"酸性撕咬", -- [14]
				"熔岩爆裂", -- [15]
				"熔合闪电", -- [16]
				"震击", -- [17]
				"机械脚踢", -- [18]
				"切割金属废料", -- [19]
				"翔龙在天", -- [20]
				"开拓", -- [21]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["buffer"] = {
				["蛛网"] = 0,
				["冲刺"] = 0,
				["魔法增效"] = 0,
				["吸血诅咒"] = 0,
				["变形辐射"] = 0,
				["开拓"] = 0,
				["切割金属废料"] = 0,
				["机械脚踢"] = 0,
				["毒脓"] = 0,
				["翔龙在天"] = 0,
				["吸血冲锋"] = 0,
				["蛛网裹体"] = 0,
				["酸性撕咬"] = 0,
				["震击"] = 0,
				["熔合闪电"] = 0,
				["野蛮打击"] = 0,
				["撕裂肉体"] = 0,
				["血晕"] = 0,
				["吸血鬼打击"] = 0,
				["熔岩爆裂"] = 0,
				["暗影顺劈"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["buffer"] = {
				"亡者复生", -- [1]
				"霜之哀伤的怒火", -- [2]
				"灵魂爆裂", -- [3]
				"卑劣的灵魂", -- [4]
				"冷酷严冬", -- [5]
				"激怒", -- [6]
				"召唤食尸鬼苦工", -- [7]
				"蚀骨之寒", -- [8]
				"冰霜光环", -- [9]
				"缴械", -- [10]
				"寒冰之刃", -- [11]
				"冲刺", -- [12]
				"损毁", -- [13]
				"神圣涌动", -- [14]
				"激素刺激", -- [15]
				"箭雨", -- [16]
				"死亡之拥", -- [17]
				"冰冻之球", -- [18]
				"北地之寒", -- [19]
				"急速射击", -- [20]
				"哀伤之雾", -- [21]
				"鲜血唤醒", -- [22]
				"暗影步", -- [23]
				"战斗怒吼", -- [24]
				"防护遮罩", -- [25]
				"法术结界护罩", -- [26]
				"疾病之云", -- [27]
				"虹吸精华", -- [28]
				"吸血光环", -- [29]
				"畸变之力", -- [30]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["buffer"] = {
				["霜之哀伤的怒火"] = 0,
				["卑劣的灵魂"] = 0,
				["低吼"] = 0,
				["寒冰箭雨"] = 0,
				["污染"] = 0,
				["寄生"] = 0,
				["寒冰坟墓"] = 0,
				["严寒"] = 0,
				["寒冰之刃"] = 0,
				["灵魂尖啸"] = 0,
				["穿刺之矛"] = 0,
				["被切割的精魄"] = 0,
				["寒冰吐息"] = 0,
				["冷酷严冬"] = 0,
				["尾击"] = 0,
				["魔铁炸弹"] = 0,
				["召唤蹒跚的血僵尸"] = 0,
				["召唤食尸鬼苦工"] = 0,
				["饱受折磨"] = 0,
				["惩击"] = 0,
				["震荡冲击"] = 0,
				["震荡波"] = 0,
				["地震"] = 0,
				["地穴甲虫"] = 0,
				["复活勇士"] = 0,
				["激怒"] = 0,
				["冷焰喷射"] = 0,
				["寒冰箭"] = 0,
				["酸性爆炸"] = 0,
				["冰霜吐息"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["buffer"] = {
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["buffer"] = {
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["buffer"] = {
				["亡者复生"] = 0,
				["冷酷严冬"] = 0,
				["法术结界护罩"] = 0,
				["灵魂爆裂"] = 0,
				["暗影步"] = 0,
				["霜之哀伤的怒火"] = 0,
				["吸血光环"] = 0,
				["激怒"] = 0,
				["战斗怒吼"] = 0,
				["畸变之力"] = 0,
				["冲刺"] = 0,
				["虹吸精华"] = 0,
				["蚀骨之寒"] = 0,
				["鲜血唤醒"] = 0,
				["冰冻之球"] = 0,
				["激素刺激"] = 0,
				["寒冰之刃"] = 0,
				["疾病之云"] = 0,
				["召唤食尸鬼苦工"] = 0,
				["北地之寒"] = 0,
				["卑劣的灵魂"] = 0,
				["缴械"] = 0,
				["哀伤之雾"] = 0,
				["冰霜光环"] = 0,
				["急速射击"] = 0,
				["防护遮罩"] = 0,
				["损毁"] = 0,
				["箭雨"] = 0,
				["死亡之拥"] = 0,
				["神圣涌动"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["buffer"] = {
				"霜之哀伤的怒火", -- [1]
				"卑劣的灵魂", -- [2]
				"污染", -- [3]
				"地震", -- [4]
				"灵魂尖啸", -- [5]
				"饱受折磨", -- [6]
				"冷酷严冬", -- [7]
				"震荡波", -- [8]
				"激怒", -- [9]
				"召唤蹒跚的血僵尸", -- [10]
				"召唤食尸鬼苦工", -- [11]
				"寄生", -- [12]
				"被切割的精魄", -- [13]
				"冷焰喷射", -- [14]
				"严寒", -- [15]
				"尾击", -- [16]
				"冰霜吐息", -- [17]
				"低吼", -- [18]
				"寒冰吐息", -- [19]
				"震荡冲击", -- [20]
				"寒冰之刃", -- [21]
				"寒冰坟墓", -- [22]
				"寒冰箭", -- [23]
				"地穴甲虫", -- [24]
				"酸性爆炸", -- [25]
				"寒冰箭雨", -- [26]
				"魔铁炸弹", -- [27]
				"惩击", -- [28]
				"复活勇士", -- [29]
				"穿刺之矛", -- [30]
			},
			["filt"] = {
			},
		},
		["PROFILE"] = {
		},
	},
}
