
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"裂筋", -- [1]
				"撕裂", -- [2]
				"专注爆裂", -- [3]
				"毁灭撕咬", -- [4]
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["filt"] = {
			},
			["buffer"] = {
				["专注爆裂"] = 0,
				["毁灭撕咬"] = 0,
				["裂筋"] = 0,
				["撕裂"] = 0,
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"迅捷飞行形态", -- [1]
				"切割", -- [2]
				"阿彻鲁斯死亡战马", -- [3]
				"召唤萨拉斯军马", -- [4]
				"俯冲轰炸", -- [5]
				"势如破竹", -- [6]
				"踏风连击：幻灭踢", -- [7]
				"侦测到装备！", -- [8]
				"精神充沛", -- [9]
				"猛虎连击", -- [10]
				"虎眼酒", -- [11]
				"见招拆招", -- [12]
				"踏风连击：猛虎掌", -- [13]
				"生死簿", -- [14]
				"怒雷破", -- [15]
				"石头穴居人之网", -- [16]
				"地狱火", -- [17]
				"寒冰指", -- [18]
				"贤哲之智", -- [19]
				"专注爆裂", -- [20]
				"混乱之雨", -- [21]
				"潜伏", -- [22]
				"魔兽世界八周年！", -- [23]
				"狂野怒火", -- [24]
				"野兽之心", -- [25]
				"疯乱", -- [26]
				"激怒", -- [27]
				"钓鱼", -- [28]
				"热力迸发", -- [29]
				"法网恢恢", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["filt"] = {
			},
			["buffer"] = {
				["轻便视网膜屏保护器"] = 0,
				["断裂修补匠齿轮"] = 0,
				["大地之箭"] = 0,
				["八宝饭"] = 0,
				["瞄准射击"] = 0,
				["人参野雉汤"] = 0,
				["阿彻鲁斯死亡战马"] = 0,
				["熔炼延极锭"] = 0,
				["烈焰风暴"] = 0,
				["水箭"] = 0,
				["钩网"] = 0,
				["射击"] = 0,
				["熔炼幽冥铁"] = 0,
				["暗影箭"] = 0,
				["巨大的悲伤"] = 0,
				["魔古鱼汤"] = 0,
				["烧烤大餐"] = 0,
				["圆润修补匠齿轮"] = 0,
				["幽冥铁螺栓"] = 0,
				["和谐之歌"] = 0,
				["腐蚀术"] = 0,
				["传送：奥格瑞玛"] = 0,
				["飞翼打击"] = 0,
				["智慧卷轴"] = 0,
				["猛击"] = 0,
				["岩石气息"] = 0,
				["风绒布卷"] = 0,
				["寒冰箭"] = 0,
				["采集草药"] = 0,
				["谷地小炒"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["filt"] = {
			},
			["buffer"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"八宝饭", -- [1]
				"人参野雉汤", -- [2]
				"熔炼幽冥铁", -- [3]
				"熔炼延极锭", -- [4]
				"烧烤大餐", -- [5]
				"谷地小炒", -- [6]
				"飞翼打击", -- [7]
				"巨大的悲伤", -- [8]
				"射击", -- [9]
				"阿彻鲁斯死亡战马", -- [10]
				"风绒布卷", -- [11]
				"断裂修补匠齿轮", -- [12]
				"圆润修补匠齿轮", -- [13]
				"魔古鱼汤", -- [14]
				"轻便视网膜屏保护器", -- [15]
				"幽冥铁螺栓", -- [16]
				"智慧卷轴", -- [17]
				"传送：奥格瑞玛", -- [18]
				"和谐之歌", -- [19]
				"钩网", -- [20]
				"瞄准射击", -- [21]
				"采集草药", -- [22]
				"岩石气息", -- [23]
				"大地之箭", -- [24]
				"暗影箭", -- [25]
				"腐蚀术", -- [26]
				"猛击", -- [27]
				"烈焰风暴", -- [28]
				"水箭", -- [29]
				"寒冰箭", -- [30]
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["filt"] = {
			},
			["buffer"] = {
				["虎眼酒"] = 0,
				["侦测到装备！"] = 0,
				["疯乱"] = 0,
				["迅捷飞行形态"] = 0,
				["生死簿"] = 0,
				["钓鱼"] = 0,
				["阿彻鲁斯死亡战马"] = 0,
				["魔兽世界八周年！"] = 0,
				["切割"] = 0,
				["专注爆裂"] = 0,
				["踏风连击：幻灭踢"] = 0,
				["潜伏"] = 0,
				["踏风连击：猛虎掌"] = 0,
				["势如破竹"] = 0,
				["见招拆招"] = 0,
				["猛虎连击"] = 0,
				["精神充沛"] = 0,
				["激怒"] = 0,
				["野兽之心"] = 0,
				["寒冰指"] = 0,
				["石头穴居人之网"] = 0,
				["法网恢恢"] = 0,
				["怒雷破"] = 0,
				["狂野怒火"] = 0,
				["贤哲之智"] = 0,
				["热力迸发"] = 0,
				["召唤萨拉斯军马"] = 0,
				["混乱之雨"] = 0,
				["俯冲轰炸"] = 0,
				["地狱火"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
			},
		},
		["PROFILE"] = {
		},
	},
}
