
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["buffer"] = {
				"冰枪术", -- [1]
				"奥术弹幕", -- [2]
				"冲锋", -- [3]
				"繁花铺道", -- [4]
				"无面者的印记", -- [5]
				"胁迫", -- [6]
				"斜掠", -- [7]
				"锯齿利刃", -- [8]
				"破坏", -- [9]
				"螳螂军火爆炸", -- [10]
				"水泡喷溅", -- [11]
				"舞空脚", -- [12]
				"煞能尖啸", -- [13]
				"投掷火炬", -- [14]
				"震颤", -- [15]
				"血肉撕咬", -- [16]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["buffer"] = {
				["血肉撕咬"] = 0,
				["无面者的印记"] = 0,
				["螳螂军火爆炸"] = 0,
				["冲锋"] = 0,
				["水泡喷溅"] = 0,
				["锯齿利刃"] = 0,
				["奥术弹幕"] = 0,
				["斜掠"] = 0,
				["舞空脚"] = 0,
				["震颤"] = 0,
				["繁花铺道"] = 0,
				["煞能尖啸"] = 0,
				["冰枪术"] = 0,
				["胁迫"] = 0,
				["投掷火炬"] = 0,
				["破坏"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["buffer"] = {
				"俯冲轰炸", -- [1]
				"奥术强化", -- [2]
				"气定神闲", -- [3]
				"复仇之怒雕文", -- [4]
				"复仇之怒", -- [5]
				"战争艺术", -- [6]
				"荣耀堡垒", -- [7]
				"神圣复仇者", -- [8]
				"奥术飞弹！", -- [9]
				"风暴之盾", -- [10]
				"集结呐喊", -- [11]
				"释放愤怒", -- [12]
				"复苏之雾", -- [13]
				"圣光之速", -- [14]
				"荣耀圣令雕文", -- [15]
				"祈愿", -- [16]
				"能量符文", -- [17]
				"保护之手", -- [18]
				"熔岩护甲", -- [19]
				"法师护甲", -- [20]
				"怨毒", -- [21]
				"兽群领袖", -- [22]
				"迅刃之黠", -- [23]
				"强击光环", -- [24]
				"风之优雅", -- [25]
				"燃烧之怒", -- [26]
				"抚慰之雾", -- [27]
				"永恒之火", -- [28]
				"虔诚光环", -- [29]
				"王者祝福", -- [30]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["buffer"] = {
				["强效治疗术"] = 0,
				["混乱之箭"] = 0,
				["法师护甲"] = 0,
				["炎爆术"] = 0,
				["烧尽"] = 0,
				["无尽怒气"] = 0,
				["恶魔传送门"] = 0,
				["沸魂"] = 0,
				["烈焰风暴"] = 0,
				["圣光术"] = 0,
				["神圣之火"] = 0,
				["治疗链"] = 0,
				["快速治疗"] = 0,
				["灵魂之火"] = 0,
				["渐燃之怒"] = 0,
				["治疗祷言"] = 0,
				["献祭"] = 0,
				["暗影箭"] = 0,
				["心灵震爆"] = 0,
				["惩击"] = 0,
				["超度邪恶"] = 0,
				["愤怒"] = 0,
				["治疗术"] = 0,
				["奥术冲击"] = 0,
				["释放愤怒"] = 0,
				["怨毒"] = 0,
				["圣言术：佑"] = 0,
				["心灵尖刺"] = 0,
				["弹弓火球"] = 0,
				["狂怒箭"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["buffer"] = {
				["冰霜疫病"] = 0,
				["血之疫病"] = 0,
				["冰霜新星"] = 0,
				["暗言术：痛"] = 0,
				["减速药膏"] = 0,
				["吸血鬼之触"] = 0,
				["怨毒"] = 0,
				["献祭"] = 0,
				["复仇者之盾"] = 0,
				["清算"] = 0,
				["致命药膏"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["buffer"] = {
				"怨毒", -- [1]
				"冰霜新星", -- [2]
				"清算", -- [3]
				"献祭", -- [4]
				"致命药膏", -- [5]
				"减速药膏", -- [6]
				"血之疫病", -- [7]
				"冰霜疫病", -- [8]
				"复仇者之盾", -- [9]
				"吸血鬼之触", -- [10]
				"暗言术：痛", -- [11]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["buffer"] = {
				["能量符文"] = 0,
				["熔岩护甲"] = 0,
				["法师护甲"] = 0,
				["战争艺术"] = 0,
				["虔诚光环"] = 0,
				["强击光环"] = 0,
				["荣耀堡垒"] = 0,
				["燃烧之怒"] = 0,
				["复仇之怒雕文"] = 0,
				["永恒之火"] = 0,
				["奥术飞弹！"] = 0,
				["复苏之雾"] = 0,
				["气定神闲"] = 0,
				["王者祝福"] = 0,
				["神圣复仇者"] = 0,
				["迅刃之黠"] = 0,
				["风暴之盾"] = 0,
				["奥术强化"] = 0,
				["释放愤怒"] = 0,
				["保护之手"] = 0,
				["圣光之速"] = 0,
				["荣耀圣令雕文"] = 0,
				["兽群领袖"] = 0,
				["抚慰之雾"] = 0,
				["集结呐喊"] = 0,
				["怨毒"] = 0,
				["风之优雅"] = 0,
				["复仇之怒"] = 0,
				["俯冲轰炸"] = 0,
				["祈愿"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["buffer"] = {
				"烈焰风暴", -- [1]
				"渐燃之怒", -- [2]
				"奥术冲击", -- [3]
				"无尽怒气", -- [4]
				"超度邪恶", -- [5]
				"献祭", -- [6]
				"烧尽", -- [7]
				"混乱之箭", -- [8]
				"炎爆术", -- [9]
				"灵魂之火", -- [10]
				"暗影箭", -- [11]
				"恶魔传送门", -- [12]
				"圣言术：佑", -- [13]
				"治疗术", -- [14]
				"治疗祷言", -- [15]
				"心灵尖刺", -- [16]
				"治疗链", -- [17]
				"心灵震爆", -- [18]
				"强效治疗术", -- [19]
				"释放愤怒", -- [20]
				"快速治疗", -- [21]
				"神圣之火", -- [22]
				"惩击", -- [23]
				"狂怒箭", -- [24]
				"怨毒", -- [25]
				"沸魂", -- [26]
				"弹弓火球", -- [27]
				"圣光术", -- [28]
				"愤怒", -- [29]
				"法师护甲", -- [30]
			},
			["filt"] = {
			},
		},
		["PROFILE"] = {
		},
	},
}
