
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"胁迫", -- [1]
				"斜掠", -- [2]
				"锯齿利刃", -- [3]
				"破坏", -- [4]
				"螳螂军火爆炸", -- [5]
				"水泡喷溅", -- [6]
				"舞空脚", -- [7]
				"煞能尖啸", -- [8]
				"投掷火炬", -- [9]
				"震颤", -- [10]
				"血肉撕咬", -- [11]
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["filt"] = {
			},
			["buffer"] = {
				["血肉撕咬"] = 0,
				["螳螂军火爆炸"] = 0,
				["锯齿利刃"] = 0,
				["水泡喷溅"] = 0,
				["震颤"] = 0,
				["投掷火炬"] = 0,
				["煞能尖啸"] = 0,
				["斜掠"] = 0,
				["胁迫"] = 0,
				["舞空脚"] = 0,
				["破坏"] = 0,
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"旋风斩", -- [1]
				"尘风", -- [2]
				"壁垒", -- [3]
				"女皇的意志", -- [4]
				"风之优雅", -- [5]
				"刃舞", -- [6]
				"千刃", -- [7]
				"速度飞升", -- [8]
				"树脂之壳", -- [9]
				"引爆", -- [10]
				"焦油", -- [11]
				"狂暴", -- [12]
				"尖啸虫群", -- [13]
				"破碎的甲壳", -- [14]
				"巢穴心智", -- [15]
				"狂乱攻击", -- [16]
				"密封甲壳", -- [17]
				"激怒", -- [18]
				"狂风之力", -- [19]
				"烟雾弹", -- [20]
				"凡尘之羁", -- [21]
				"聚集之疑", -- [22]
				"青玉精华", -- [23]
				"消散", -- [24]
				"至高能量", -- [25]
				"强烈", -- [26]
				"金色罩袍", -- [27]
				"舞空脚", -- [28]
				"水泡", -- [29]
				"水泡护盾", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["filt"] = {
			},
			["buffer"] = {
				["疑之影"] = 0,
				["凝视"] = 0,
				["水泡爆炸"] = 0,
				["风暴"] = 0,
				["玉火"] = 0,
				["重击头槌"] = 0,
				["旋风斩"] = 0,
				["召唤腐化之水"] = 0,
				["痛楚"] = 0,
				["粉碎决心"] = 0,
				["树脂之壳"] = 0,
				["利刃冲锋"] = 0,
				["锤击"] = 0,
				["强风冲击"] = 0,
				["治疗"] = 0,
				["青玉精华"] = 0,
				["冲刺打击"] = 0,
				["尖啸虫群"] = 0,
				["闪电箭"] = 0,
				["震击"] = 0,
				["鸣雀夜曲"] = 0,
				["树脂编织"] = 0,
				["晶化"] = 0,
				["投掷砖块"] = 0,
				["燃烧沥青"] = 0,
				["围攻"] = 0,
				["狂乱攻击"] = 0,
				["风之优雅"] = 0,
				["水流长枪"] = 0,
				["践踏"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["filt"] = {
			},
			["buffer"] = {
				["吸血鬼之触"] = 0,
				["暗言术：痛"] = 0,
				["复仇者之盾"] = 0,
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"震击", -- [1]
				"锤击", -- [2]
				"旋风斩", -- [3]
				"闪电箭", -- [4]
				"晶化", -- [5]
				"燃烧沥青", -- [6]
				"投掷砖块", -- [7]
				"风暴", -- [8]
				"利刃冲锋", -- [9]
				"风之优雅", -- [10]
				"围攻", -- [11]
				"治疗", -- [12]
				"冲刺打击", -- [13]
				"树脂之壳", -- [14]
				"树脂编织", -- [15]
				"践踏", -- [16]
				"凝视", -- [17]
				"尖啸虫群", -- [18]
				"狂乱攻击", -- [19]
				"重击头槌", -- [20]
				"强风冲击", -- [21]
				"玉火", -- [22]
				"青玉精华", -- [23]
				"粉碎决心", -- [24]
				"疑之影", -- [25]
				"痛楚", -- [26]
				"鸣雀夜曲", -- [27]
				"水泡爆炸", -- [28]
				"召唤腐化之水", -- [29]
				"水流长枪", -- [30]
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["filt"] = {
			},
			["buffer"] = {
				["至高能量"] = 0,
				["千刃"] = 0,
				["速度飞升"] = 0,
				["聚集之疑"] = 0,
				["引爆"] = 0,
				["烟雾弹"] = 0,
				["狂风之力"] = 0,
				["刃舞"] = 0,
				["尘风"] = 0,
				["旋风斩"] = 0,
				["树脂之壳"] = 0,
				["焦油"] = 0,
				["女皇的意志"] = 0,
				["消散"] = 0,
				["狂乱攻击"] = 0,
				["水泡"] = 0,
				["青玉精华"] = 0,
				["激怒"] = 0,
				["水泡护盾"] = 0,
				["壁垒"] = 0,
				["密封甲壳"] = 0,
				["破碎的甲壳"] = 0,
				["巢穴心智"] = 0,
				["尖啸虫群"] = 0,
				["舞空脚"] = 0,
				["强烈"] = 0,
				["金色罩袍"] = 0,
				["风之优雅"] = 0,
				["狂暴"] = 0,
				["凡尘之羁"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"复仇者之盾", -- [1]
				"吸血鬼之触", -- [2]
				"暗言术：痛", -- [3]
			},
		},
		["PROFILE"] = {
		},
	},
}
