
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"无尽诅咒", -- [1]
				"致死打击", -- [2]
				"吸取灵魂", -- [3]
				"幻灭踢", -- [4]
				"暗影震击", -- [5]
				"打击", -- [6]
				"暗影之拥", -- [7]
				"幻影打击", -- [8]
				"凿击", -- [9]
				"圆弧斩", -- [10]
				"冲锋", -- [11]
				"减速", -- [12]
				"残害", -- [13]
				"灵魂打击", -- [14]
				"上钩拳", -- [15]
				"盾牌猛击", -- [16]
				"致命药膏", -- [17]
				"影袭", -- [18]
				"奥术飞弹", -- [19]
				"顺劈斩", -- [20]
				"破胆怒吼", -- [21]
				"撕裂", -- [22]
				"破甲攻击", -- [23]
				"断筋", -- [24]
				"穿刺", -- [25]
				"力量衰减", -- [26]
				"暗言术：痛", -- [27]
				"缴械", -- [28]
				"火锥术", -- [29]
				"复仇", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["filt"] = {
			},
			["buffer"] = {
				["致死打击"] = 0,
				["影袭"] = 0,
				["奥术飞弹"] = 0,
				["幻影打击"] = 0,
				["凿击"] = 0,
				["吸取灵魂"] = 0,
				["火锥术"] = 0,
				["断筋"] = 0,
				["破甲攻击"] = 0,
				["暗影之拥"] = 0,
				["顺劈斩"] = 0,
				["圆弧斩"] = 0,
				["幻灭踢"] = 0,
				["灵魂打击"] = 0,
				["复仇"] = 0,
				["残害"] = 0,
				["破胆怒吼"] = 0,
				["冲锋"] = 0,
				["盾牌猛击"] = 0,
				["打击"] = 0,
				["致命药膏"] = 0,
				["暗言术：痛"] = 0,
				["减速"] = 0,
				["穿刺"] = 0,
				["力量衰减"] = 0,
				["缴械"] = 0,
				["上钩拳"] = 0,
				["暗影震击"] = 0,
				["无尽诅咒"] = 0,
				["撕裂"] = 0,
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"魔法瓦解光环", -- [1]
				"暗影之盾", -- [2]
				"神圣之盾", -- [3]
				"虔诚光环", -- [4]
				"霜甲术", -- [5]
				"旋风斩", -- [6]
				"发怒", -- [7]
				"飓风打击", -- [8]
				"灵魂视界", -- [9]
				"防护光环", -- [10]
				"见招拆招", -- [11]
				"兽群领袖", -- [12]
				"生死簿", -- [13]
				"神鹤引项踢", -- [14]
				"复苏之雾", -- [15]
				"怒雷破", -- [16]
				"灵魂复仇", -- [17]
				"暗影守卫", -- [18]
				"闪现术", -- [19]
				"战斗怒吼", -- [20]
				"暗影形态", -- [21]
				"黑暗之壳", -- [22]
				"酸液喷泉", -- [23]
				"铁木树皮", -- [24]
				"生命之种", -- [25]
				"法术反射", -- [26]
				"狂乱", -- [27]
				"拍击！", -- [28]
				"恶魔护盾", -- [29]
				"反击风暴", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["filt"] = {
			},
			["buffer"] = {
				["腐蚀之种"] = 0,
				["召唤化身"] = 0,
				["火球术"] = 0,
				["地震术"] = 0,
				["法力燃烧"] = 0,
				["圣光术"] = 0,
				["变形术"] = 0,
				["灵魂缎带"] = 0,
				["暴怒"] = 0,
				["虚空冲击"] = 0,
				["驱散射击"] = 0,
				["射击"] = 0,
				["快速治疗"] = 0,
				["毒蛇钉刺"] = 0,
				["奥术箭"] = 0,
				["灵魂复仇"] = 0,
				["被偷走的灵魂"] = 0,
				["遗忘之触"] = 0,
				["黏性苔藓"] = 0,
				["特效治疗"] = 0,
				["腐蚀术"] = 0,
				["愤怒"] = 0,
				["治疗术"] = 0,
				["黑暗之壳"] = 0,
				["暗影箭"] = 0,
				["精灵之火"] = 0,
				["沙尘吐息"] = 0,
				["寒冰箭"] = 0,
				["暗影愈合"] = 0,
				["震荡射击"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["filt"] = {
			},
			["buffer"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"沙尘吐息", -- [1]
				"腐蚀术", -- [2]
				"快速治疗", -- [3]
				"震荡射击", -- [4]
				"圣光术", -- [5]
				"治疗术", -- [6]
				"驱散射击", -- [7]
				"召唤化身", -- [8]
				"被偷走的灵魂", -- [9]
				"灵魂缎带", -- [10]
				"腐蚀之种", -- [11]
				"暗影愈合", -- [12]
				"暴怒", -- [13]
				"特效治疗", -- [14]
				"寒冰箭", -- [15]
				"遗忘之触", -- [16]
				"毒蛇钉刺", -- [17]
				"射击", -- [18]
				"灵魂复仇", -- [19]
				"暗影箭", -- [20]
				"火球术", -- [21]
				"奥术箭", -- [22]
				"变形术", -- [23]
				"地震术", -- [24]
				"法力燃烧", -- [25]
				"精灵之火", -- [26]
				"虚空冲击", -- [27]
				"黑暗之壳", -- [28]
				"愤怒", -- [29]
				"黏性苔藓", -- [30]
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["filt"] = {
			},
			["buffer"] = {
				["狂乱"] = 0,
				["怒雷破"] = 0,
				["复苏之雾"] = 0,
				["生死簿"] = 0,
				["铁木树皮"] = 0,
				["旋风斩"] = 0,
				["战斗怒吼"] = 0,
				["法术反射"] = 0,
				["暗影形态"] = 0,
				["酸液喷泉"] = 0,
				["魔法瓦解光环"] = 0,
				["霜甲术"] = 0,
				["神鹤引项踢"] = 0,
				["反击风暴"] = 0,
				["见招拆招"] = 0,
				["灵魂视界"] = 0,
				["灵魂复仇"] = 0,
				["防护光环"] = 0,
				["生命之种"] = 0,
				["暗影守卫"] = 0,
				["飓风打击"] = 0,
				["暗影之盾"] = 0,
				["兽群领袖"] = 0,
				["神圣之盾"] = 0,
				["拍击！"] = 0,
				["黑暗之壳"] = 0,
				["恶魔护盾"] = 0,
				["闪现术"] = 0,
				["发怒"] = 0,
				["虔诚光环"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
			},
		},
		["PROFILE"] = {
		},
	},
}
