
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"凶猛头槌", -- [1]
				"精灵之火", -- [2]
				"裂伤", -- [3]
				"凿击", -- [4]
				"暗影之刃副手", -- [5]
				"暗影之刃", -- [6]
				"脚踢", -- [7]
				"冰冷触摸", -- [8]
				"猛击", -- [9]
				"法术反制", -- [10]
				"火焰冲击", -- [11]
				"责难", -- [12]
				"冰枪术", -- [13]
				"制裁之锤", -- [14]
				"震山掌", -- [15]
				"炼狱冲击", -- [16]
				"宁神射击", -- [17]
				"愤怒之锤", -- [18]
				"强攻", -- [19]
				"削弱护甲", -- [20]
				"缴械", -- [21]
				"穿刺打击", -- [22]
				"破坏", -- [23]
				"螳螂军火爆炸", -- [24]
				"活动炸弹", -- [25]
				"灵魂燃烧", -- [26]
				"恶毒之咬", -- [27]
				"破甲攻击", -- [28]
				"打击", -- [29]
				"破胆怒吼", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["filt"] = {
			},
			["buffer"] = {
				["灵魂燃烧"] = 0,
				["法术反制"] = 0,
				["破甲攻击"] = 0,
				["穿刺打击"] = 0,
				["凿击"] = 0,
				["制裁之锤"] = 0,
				["猛击"] = 0,
				["活动炸弹"] = 0,
				["愤怒之锤"] = 0,
				["宁神射击"] = 0,
				["精灵之火"] = 0,
				["冰冷触摸"] = 0,
				["恶毒之咬"] = 0,
				["火焰冲击"] = 0,
				["脚踢"] = 0,
				["震山掌"] = 0,
				["责难"] = 0,
				["螳螂军火爆炸"] = 0,
				["破胆怒吼"] = 0,
				["打击"] = 0,
				["暗影之刃副手"] = 0,
				["炼狱冲击"] = 0,
				["暗影之刃"] = 0,
				["裂伤"] = 0,
				["强攻"] = 0,
				["缴械"] = 0,
				["削弱护甲"] = 0,
				["凶猛头槌"] = 0,
				["冰枪术"] = 0,
				["破坏"] = 0,
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"俯冲轰炸", -- [1]
				"释放愤怒", -- [2]
				"寒冬号角", -- [3]
				"十歌符记", -- [4]
				"星界转移", -- [5]
				"秩序之光", -- [6]
				"大地之盾", -- [7]
				"王者祝福", -- [8]
				"潮汐奔涌", -- [9]
				"灵魂行者的恩赐", -- [10]
				"火焰之雨", -- [11]
				"升腾", -- [12]
				"风之优雅", -- [13]
				"兽群领袖", -- [14]
				"能量洪流", -- [15]
				"强击光环", -- [16]
				"生命之血", -- [17]
				"燃烧之怒", -- [18]
				"暗影冥思", -- [19]
				"祝福硬币", -- [20]
				"风歌", -- [21]
				"灾难之握", -- [22]
				"集结呐喊", -- [23]
				"急速射击", -- [24]
				"胜利", -- [25]
				"折磨反射", -- [26]
				"乱舞", -- [27]
				"西瓜炸弹", -- [28]
				"战斗怒吼", -- [29]
				"圣殿骑士的裁决雕文", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["filt"] = {
			},
			["buffer"] = {
				["能量符文"] = 0,
				["熔岩护甲"] = 0,
				["炎爆术"] = 0,
				["痛苦无常"] = 0,
				["火球术"] = 0,
				["烧尽"] = 0,
				["闪电链"] = 0,
				["无尽怒气"] = 0,
				["妖术"] = 0,
				["沸魂"] = 0,
				["心灵震爆"] = 0,
				["水箭"] = 0,
				["引爆汽油桶"] = 0,
				["厄运箭"] = 0,
				["心灵尖刺"] = 0,
				["圣光术"] = 0,
				["霜甲术"] = 0,
				["魂体双分"] = 0,
				["治疗链"] = 0,
				["眼镜蛇射击"] = 0,
				["鬼影缠身"] = 0,
				["愤怒"] = 0,
				["吸血鬼之触"] = 0,
				["治疗之触"] = 0,
				["释放愤怒"] = 0,
				["升腾之雾"] = 0,
				["圣言术：佑"] = 0,
				["寒冰箭"] = 0,
				["渐燃之怒"] = 0,
				["治疗之涌"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["filt"] = {
			},
			["buffer"] = {
				["活动炸弹"] = 0,
				["冰霜疫病"] = 0,
				["重伤"] = 0,
				["炽燃烟火"] = 0,
				["龙息术"] = 0,
				["刃舞"] = 0,
				["加速"] = 0,
				["穿刺射击"] = 0,
				["浴血奋战"] = 0,
				["暗影烈焰"] = 0,
				["血之疫病"] = 0,
				["激怒"] = 0,
				["暗言术：痛"] = 0,
				["吸血鬼之触"] = 0,
				["猩红风暴"] = 0,
				["冰冻"] = 0,
				["寒冰锁链"] = 0,
				["献祭"] = 0,
				["点燃"] = 0,
				["怒火释放"] = 0,
				["沉默射击"] = 0,
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"妖术", -- [1]
				"魂体双分", -- [2]
				"释放愤怒", -- [3]
				"渐燃之怒", -- [4]
				"闪电链", -- [5]
				"无尽怒气", -- [6]
				"能量符文", -- [7]
				"圣言术：佑", -- [8]
				"心灵尖刺", -- [9]
				"炎爆术", -- [10]
				"痛苦无常", -- [11]
				"治疗链", -- [12]
				"升腾之雾", -- [13]
				"火球术", -- [14]
				"治疗之触", -- [15]
				"鬼影缠身", -- [16]
				"厄运箭", -- [17]
				"烧尽", -- [18]
				"治疗之涌", -- [19]
				"水箭", -- [20]
				"眼镜蛇射击", -- [21]
				"吸血鬼之触", -- [22]
				"寒冰箭", -- [23]
				"沸魂", -- [24]
				"引爆汽油桶", -- [25]
				"心灵震爆", -- [26]
				"圣光术", -- [27]
				"熔岩护甲", -- [28]
				"愤怒", -- [29]
				"霜甲术", -- [30]
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["filt"] = {
			},
			["buffer"] = {
				["乱舞"] = 0,
				["秩序之光"] = 0,
				["集结呐喊"] = 0,
				["释放愤怒"] = 0,
				["寒冬号角"] = 0,
				["暗影冥思"] = 0,
				["强击光环"] = 0,
				["风歌"] = 0,
				["折磨反射"] = 0,
				["燃烧之怒"] = 0,
				["胜利"] = 0,
				["生命之血"] = 0,
				["星界转移"] = 0,
				["战斗怒吼"] = 0,
				["西瓜炸弹"] = 0,
				["祝福硬币"] = 0,
				["大地之盾"] = 0,
				["十歌符记"] = 0,
				["王者祝福"] = 0,
				["灵魂行者的恩赐"] = 0,
				["火焰之雨"] = 0,
				["灾难之握"] = 0,
				["升腾"] = 0,
				["潮汐奔涌"] = 0,
				["急速射击"] = 0,
				["能量洪流"] = 0,
				["兽群领袖"] = 0,
				["风之优雅"] = 0,
				["俯冲轰炸"] = 0,
				["圣殿骑士的裁决雕文"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"寒冰锁链", -- [1]
				"献祭", -- [2]
				"血之疫病", -- [3]
				"冰霜疫病", -- [4]
				"龙息术", -- [5]
				"冰冻", -- [6]
				"加速", -- [7]
				"刃舞", -- [8]
				"炽燃烟火", -- [9]
				"浴血奋战", -- [10]
				"重伤", -- [11]
				"猩红风暴", -- [12]
				"暗影烈焰", -- [13]
				"暗言术：痛", -- [14]
				"吸血鬼之触", -- [15]
				"激怒", -- [16]
				"穿刺射击", -- [17]
				"沉默射击", -- [18]
				"点燃", -- [19]
				"怒火释放", -- [20]
				"活动炸弹", -- [21]
			},
		},
		["PROFILE"] = {
		},
	},
}
