
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"柔韧的树脂", -- [1]
				"闪烁火焰", -- [2]
				"黑暗吞噬", -- [3]
				"毁灭", -- [4]
				"投掷", -- [5]
				"捕猎时间", -- [6]
				"破坏", -- [7]
				"暗影步", -- [8]
				"震颤", -- [9]
				"水泡喷溅", -- [10]
				"投掷火炬", -- [11]
				"舞空脚", -- [12]
				"煞能尖啸", -- [13]
				"心灵冰冻", -- [14]
				"跳跃冲击", -- [15]
				"投掷盾牌", -- [16]
				"利刃冲锋", -- [17]
				"影袭", -- [18]
				"虚弱之触", -- [19]
				"死亡之握", -- [20]
				"灭杀", -- [21]
				"螳螂军火爆炸", -- [22]
				"捅你！", -- [23]
				"活力诅咒", -- [24]
				"紫晶之池", -- [25]
				"破体之噬", -- [26]
				"责难", -- [27]
				"风剪", -- [28]
				"心灵惊骇", -- [29]
				"宁神射击", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["filt"] = {
			},
			["buffer"] = {
				["死亡之握"] = 0,
				["跳跃冲击"] = 0,
				["风剪"] = 0,
				["破体之噬"] = 0,
				["投掷"] = 0,
				["暗影步"] = 0,
				["投掷盾牌"] = 0,
				["震颤"] = 0,
				["煞能尖啸"] = 0,
				["黑暗吞噬"] = 0,
				["虚弱之触"] = 0,
				["利刃冲锋"] = 0,
				["宁神射击"] = 0,
				["捕猎时间"] = 0,
				["心灵惊骇"] = 0,
				["责难"] = 0,
				["心灵冰冻"] = 0,
				["螳螂军火爆炸"] = 0,
				["投掷火炬"] = 0,
				["捅你！"] = 0,
				["活力诅咒"] = 0,
				["灭杀"] = 0,
				["紫晶之池"] = 0,
				["闪烁火焰"] = 0,
				["舞空脚"] = 0,
				["水泡喷溅"] = 0,
				["影袭"] = 0,
				["柔韧的树脂"] = 0,
				["毁灭"] = 0,
				["破坏"] = 0,
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"胜利召唤", -- [1]
				"冰霜之柱", -- [2]
				"杀戮机器", -- [3]
				"残酷之握", -- [4]
				"疾跑", -- [5]
				"辐射能量", -- [6]
				"过载", -- [7]
				"不稳定的能量", -- [8]
				"能量导管", -- [9]
				"吸取能量", -- [10]
				"静态熔焰", -- [11]
				"星界气息", -- [12]
				"典狱官的愤怒", -- [13]
				"纳拉克煞之触", -- [14]
				"反冲", -- [15]
				"能量符文", -- [16]
				"法力茶", -- [17]
				"群体攻击", -- [18]
				"吸取灵魂", -- [19]
				"智力", -- [20]
				"恢复", -- [21]
				"畏缩", -- [22]
				"爆燃", -- [23]
				"亮纹", -- [24]
				"怯懦", -- [25]
				"疯狂", -- [26]
				"大象无形", -- [27]
				"福音传播", -- [28]
				"天神祝福", -- [29]
				"野性成长", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["filt"] = {
			},
			["buffer"] = {
				["能量符文"] = 0,
				["腐蚀之种"] = 0,
				["保护者显形"] = 0,
				["闪电吐息"] = 0,
				["烧尽"] = 0,
				["旋风"] = 0,
				["星界气息"] = 0,
				["寒冰箭"] = 0,
				["阻碍猛刺"] = 0,
				["强力横扫"] = 0,
				["眼镜蛇射击"] = 0,
				["聚焦能量"] = 0,
				["愈合"] = 0,
				["灵魂之火"] = 0,
				["石化血肉"] = 0,
				["横扫千军"] = 0,
				["献祭"] = 0,
				["圣光普照"] = 0,
				["心灵震爆"] = 0,
				["惩击"] = 0,
				["纯粹能量"] = 0,
				["魔能之箭"] = 0,
				["火焰箭"] = 0,
				["奥术冲击"] = 0,
				["断肢"] = 0,
				["治疗祷言"] = 0,
				["厄运箭"] = 0,
				["石块"] = 0,
				["电弧能量"] = 0,
				["纳拉克煞之触"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["filt"] = {
			},
			["buffer"] = {
				["割裂"] = 0,
				["冰霜疫病"] = 0,
				["敏捷思维"] = 0,
				["穿刺之矛"] = 0,
				["烈焰震击"] = 0,
				["纯净之手"] = 0,
				["龙息术"] = 0,
				["真言术：盾"] = 0,
				["火焰之息"] = 0,
				["炽燃烟火"] = 0,
				["加速"] = 0,
				["冲击波"] = 0,
				["冷酷严冬"] = 0,
				["浴血奋战"] = 0,
				["恩赐"] = 0,
				["净化之水"] = 0,
				["血之疫病"] = 0,
				["毒蛇钉刺"] = 0,
				["怯懦"] = 0,
				["寒冰炸弹"] = 0,
				["刃舞"] = 0,
				["吸血药膏"] = 0,
				["寒冰锁链"] = 0,
				["抚慰之雾"] = 0,
				["冰冻"] = 0,
				["献祭"] = 0,
				["心灵尖啸"] = 0,
				["寒冰箭"] = 0,
				["沉默 - 强化法术反制"] = 0,
				["炽热极速"] = 0,
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"断肢", -- [1]
				"阻碍猛刺", -- [2]
				"聚焦能量", -- [3]
				"横扫千军", -- [4]
				"电弧能量", -- [5]
				"保护者显形", -- [6]
				"星界气息", -- [7]
				"纯粹能量", -- [8]
				"强力横扫", -- [9]
				"纳拉克煞之触", -- [10]
				"石块", -- [11]
				"石化血肉", -- [12]
				"献祭", -- [13]
				"治疗祷言", -- [14]
				"能量符文", -- [15]
				"旋风", -- [16]
				"闪电吐息", -- [17]
				"寒冰箭", -- [18]
				"火焰箭", -- [19]
				"灵魂之火", -- [20]
				"愈合", -- [21]
				"圣光普照", -- [22]
				"心灵震爆", -- [23]
				"魔能之箭", -- [24]
				"烧尽", -- [25]
				"腐蚀之种", -- [26]
				"惩击", -- [27]
				"奥术冲击", -- [28]
				"厄运箭", -- [29]
				"眼镜蛇射击", -- [30]
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["filt"] = {
			},
			["buffer"] = {
				["过载"] = 0,
				["畏缩"] = 0,
				["大象无形"] = 0,
				["野性成长"] = 0,
				["吸取灵魂"] = 0,
				["爆燃"] = 0,
				["能量符文"] = 0,
				["法力茶"] = 0,
				["恢复"] = 0,
				["反冲"] = 0,
				["辐射能量"] = 0,
				["吸取能量"] = 0,
				["胜利召唤"] = 0,
				["疯狂"] = 0,
				["静态熔焰"] = 0,
				["星界气息"] = 0,
				["智力"] = 0,
				["怯懦"] = 0,
				["亮纹"] = 0,
				["不稳定的能量"] = 0,
				["疾跑"] = 0,
				["典狱官的愤怒"] = 0,
				["能量导管"] = 0,
				["残酷之握"] = 0,
				["群体攻击"] = 0,
				["福音传播"] = 0,
				["天神祝福"] = 0,
				["杀戮机器"] = 0,
				["冰霜之柱"] = 0,
				["纳拉克煞之触"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"真言术：盾", -- [1]
				"纯净之手", -- [2]
				"抚慰之雾", -- [3]
				"恩赐", -- [4]
				"净化之水", -- [5]
				"心灵尖啸", -- [6]
				"穿刺之矛", -- [7]
				"炽热极速", -- [8]
				"沉默 - 强化法术反制", -- [9]
				"割裂", -- [10]
				"寒冰箭", -- [11]
				"冷酷严冬", -- [12]
				"寒冰炸弹", -- [13]
				"火焰之息", -- [14]
				"吸血药膏", -- [15]
				"怯懦", -- [16]
				"毒蛇钉刺", -- [17]
				"敏捷思维", -- [18]
				"烈焰震击", -- [19]
				"冲击波", -- [20]
				"寒冰锁链", -- [21]
				"献祭", -- [22]
				"血之疫病", -- [23]
				"冰霜疫病", -- [24]
				"龙息术", -- [25]
				"冰冻", -- [26]
				"加速", -- [27]
				"刃舞", -- [28]
				"炽燃烟火", -- [29]
				"浴血奋战", -- [30]
			},
		},
		["PROFILE"] = {
		},
	},
}
