
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"狂野凝视", -- [1]
				"开拓", -- [2]
				"针刺", -- [3]
				"猛击", -- [4]
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["filt"] = {
			},
			["buffer"] = {
				["针刺"] = 0,
				["开拓"] = 0,
				["猛击"] = 0,
				["狂野凝视"] = 0,
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"棘皮术", -- [1]
				"满腔怒火", -- [2]
				"寒冰指", -- [3]
				"鲁莽", -- [4]
				"怒雷破", -- [5]
				"裂伤", -- [6]
				"水之护盾", -- [7]
				"疾跑", -- [8]
				"命运多舛", -- [9]
				"风歌", -- [10]
				"心灵尖刺雕文", -- [11]
				"黑暗涌动", -- [12]
				"恢复", -- [13]
				"厚皮", -- [14]
				"湍流旋涡", -- [15]
				"狂野凝视", -- [16]
				"火墙", -- [17]
				"火焰之墙", -- [18]
				"顽劣", -- [19]
				"脾气暴躁", -- [20]
				"愤怒", -- [21]
				"石龟旋", -- [22]
				"咔啡疯狂", -- [23]
				"咔啡刺激", -- [24]
				"格玛利火焰", -- [25]
				"血之怒", -- [26]
				"恶作剧", -- [27]
				"咔啡疲惫", -- [28]
				"咔啡冲刺", -- [29]
				"俯冲轰炸", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["filt"] = {
			},
			["buffer"] = {
				["雷霆"] = 0,
				["火墙"] = 0,
				["急速冲锋"] = 0,
				["心灵震爆"] = 0,
				["火球术"] = 0,
				["毁坏"] = 0,
				["瞄准射击"] = 0,
				["天哭"] = 0,
				["野牛人践踏"] = 0,
				["毁灭撕咬"] = 0,
				["扔掷易爆之球"] = 0,
				["酸液喷射"] = 0,
				["引爆汽油桶"] = 0,
				["闪电链"] = 0,
				["雷霆震击"] = 0,
				["扭动跳跃"] = 0,
				["丢西瓜"] = 0,
				["火焰之墙"] = 0,
				["闪电箭"] = 0,
				["石龟旋"] = 0,
				["战锤时刻"] = 0,
				["愤怒"] = 0,
				["吸血鬼之触"] = 0,
				["采矿"] = 0,
				["猛击"] = 0,
				["压制劈砍"] = 0,
				["恶作剧"] = 0,
				["心灵尖刺"] = 0,
				["头槌"] = 0,
				["飞翼打击"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["filt"] = {
			},
			["buffer"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"雷霆", -- [1]
				"扔掷易爆之球", -- [2]
				"采矿", -- [3]
				"引爆汽油桶", -- [4]
				"野牛人践踏", -- [5]
				"急速冲锋", -- [6]
				"闪电箭", -- [7]
				"吸血鬼之触", -- [8]
				"心灵震爆", -- [9]
				"天哭", -- [10]
				"心灵尖刺", -- [11]
				"闪电链", -- [12]
				"压制劈砍", -- [13]
				"战锤时刻", -- [14]
				"火墙", -- [15]
				"火焰之墙", -- [16]
				"火球术", -- [17]
				"愤怒", -- [18]
				"猛击", -- [19]
				"头槌", -- [20]
				"石龟旋", -- [21]
				"毁灭撕咬", -- [22]
				"雷霆震击", -- [23]
				"飞翼打击", -- [24]
				"瞄准射击", -- [25]
				"扭动跳跃", -- [26]
				"丢西瓜", -- [27]
				"毁坏", -- [28]
				"恶作剧", -- [29]
				"酸液喷射", -- [30]
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["filt"] = {
			},
			["buffer"] = {
				["棘皮术"] = 0,
				["火墙"] = 0,
				["满腔怒火"] = 0,
				["寒冰指"] = 0,
				["鲁莽"] = 0,
				["怒雷破"] = 0,
				["咔啡疯狂"] = 0,
				["咔啡疲惫"] = 0,
				["狂野凝视"] = 0,
				["心灵尖刺雕文"] = 0,
				["血之怒"] = 0,
				["厚皮"] = 0,
				["咔啡刺激"] = 0,
				["湍流旋涡"] = 0,
				["疾跑"] = 0,
				["脾气暴躁"] = 0,
				["格玛利火焰"] = 0,
				["火焰之墙"] = 0,
				["命运多舛"] = 0,
				["咔啡冲刺"] = 0,
				["石龟旋"] = 0,
				["黑暗涌动"] = 0,
				["愤怒"] = 0,
				["裂伤"] = 0,
				["水之护盾"] = 0,
				["恢复"] = 0,
				["顽劣"] = 0,
				["恶作剧"] = 0,
				["俯冲轰炸"] = 0,
				["风歌"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
			},
		},
		["PROFILE"] = {
		},
	},
}
