
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"暗影幻灵", -- [1]
				"噬灵疫病", -- [2]
				"暗言术：痛", -- [3]
				"音波钩锁", -- [4]
				"深度冻结", -- [5]
				"英勇打击", -- [6]
				"撕裂", -- [7]
				"闪烁火焰", -- [8]
				"蜡质皮肤", -- [9]
				"火焰冲击", -- [10]
				"精神鞭笞", -- [11]
				"冲锋", -- [12]
				"放逐", -- [13]
				"盾牌猛击", -- [14]
				"毁灭打击", -- [15]
				"烈焰之矛", -- [16]
				"闪电鞭笞", -- [17]
				"闪电充能", -- [18]
				"奥术震击", -- [19]
				"活力诅咒", -- [20]
				"穿刺", -- [21]
				"紫晶之池", -- [22]
				"撕裂肉体", -- [23]
				"破体之噬", -- [24]
				"斜掠爪击", -- [25]
				"敲击", -- [26]
				"猛踢", -- [27]
				"网缚", -- [28]
				"毁灭", -- [29]
				"你不要接！", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["filt"] = {
			},
			["buffer"] = {
				["猛踢"] = 0,
				["暗影幻灵"] = 0,
				["音波钩锁"] = 0,
				["噬灵疫病"] = 0,
				["破体之噬"] = 0,
				["蜡质皮肤"] = 0,
				["毁灭打击"] = 0,
				["精神鞭笞"] = 0,
				["斜掠爪击"] = 0,
				["闪电鞭笞"] = 0,
				["深度冻结"] = 0,
				["暗言术：痛"] = 0,
				["敲击"] = 0,
				["撕裂"] = 0,
				["网缚"] = 0,
				["闪电充能"] = 0,
				["放逐"] = 0,
				["英勇打击"] = 0,
				["冲锋"] = 0,
				["撕裂肉体"] = 0,
				["烈焰之矛"] = 0,
				["活力诅咒"] = 0,
				["奥术震击"] = 0,
				["紫晶之池"] = 0,
				["穿刺"] = 0,
				["你不要接！"] = 0,
				["盾牌猛击"] = 0,
				["闪烁火焰"] = 0,
				["毁灭"] = 0,
				["火焰冲击"] = 0,
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"灵魂链接", -- [1]
				"傀儡主宰", -- [2]
				"血雨", -- [3]
				"天神祝福", -- [4]
				"踏风连击：猛虎掌", -- [5]
				"飞蝗之跃", -- [6]
				"暗影步", -- [7]
				"寒冰指", -- [8]
				"冰冷智慧", -- [9]
				"风歌", -- [10]
				"焦灼真言", -- [11]
				"豪能酒", -- [12]
				"见招拆招", -- [13]
				"势如破竹", -- [14]
				"闪现术", -- [15]
				"剑刃风暴", -- [16]
				"战歌", -- [17]
				"满天星", -- [18]
				"生死簿", -- [19]
				"猛虎连击", -- [20]
				"踏风连击：幻灭踢", -- [21]
				"不稳定的血清", -- [22]
				"猛虎之力", -- [23]
				"亮纹", -- [24]
				"神圣洞察", -- [25]
				"强击光环", -- [26]
				"心灵尖刺雕文", -- [27]
				"黑暗涌动", -- [28]
				"搜寻并摧毁", -- [29]
				"闪光红玉", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["filt"] = {
			},
			["buffer"] = {
				["暗影撞击"] = 0,
				["投掷长矛"] = 0,
				["翔龙扫"] = 0,
				["火球术"] = 0,
				["孢子之云"] = 0,
				["投掷"] = 0,
				["快速治疗"] = 0,
				["吸血鬼之触"] = 0,
				["霜火之箭"] = 0,
				["烈焰风暴"] = 0,
				["腐蚀树脂"] = 0,
				["引爆汽油桶"] = 0,
				["射击"] = 0,
				["多重射击"] = 0,
				["深呼吸"] = 0,
				["震荡波"] = 0,
				["水箭"] = 0,
				["恐惧打击"] = 0,
				["影爆"] = 0,
				["心灵震爆"] = 0,
				["眼镜蛇射击"] = 0,
				["采矿"] = 0,
				["远古魔法"] = 0,
				["投掷石块"] = 0,
				["治疗波"] = 0,
				["猛击"] = 0,
				["吞噬林精"] = 0,
				["烧灼驱魔"] = 0,
				["寒冰箭"] = 0,
				["炉石"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["filt"] = {
			},
			["buffer"] = {
				["痛苦压制"] = 0,
				["缓落术"] = 0,
				["奥术光辉"] = 0,
				["操控时间"] = 0,
				["真言术：韧"] = 0,
				["天使壁垒"] = 0,
				["寒冰护体"] = 0,
				["身心合一"] = 0,
				["风暴烈酒"] = 0,
				["强化翔龙"] = 0,
				["寒冰屏障"] = 0,
				["疑心重重"] = 0,
				["冰冷智慧"] = 0,
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"炉石", -- [1]
				"水箭", -- [2]
				"霜火之箭", -- [3]
				"寒冰箭", -- [4]
				"快速治疗", -- [5]
				"吸血鬼之触", -- [6]
				"心灵震爆", -- [7]
				"采矿", -- [8]
				"腐蚀树脂", -- [9]
				"恐惧打击", -- [10]
				"吞噬林精", -- [11]
				"深呼吸", -- [12]
				"翔龙扫", -- [13]
				"影爆", -- [14]
				"眼镜蛇射击", -- [15]
				"投掷", -- [16]
				"猛击", -- [17]
				"引爆汽油桶", -- [18]
				"治疗波", -- [19]
				"射击", -- [20]
				"烈焰风暴", -- [21]
				"火球术", -- [22]
				"烧灼驱魔", -- [23]
				"多重射击", -- [24]
				"暗影撞击", -- [25]
				"震荡波", -- [26]
				"远古魔法", -- [27]
				"投掷石块", -- [28]
				"孢子之云", -- [29]
				"投掷长矛", -- [30]
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["filt"] = {
			},
			["buffer"] = {
				["豪能酒"] = 0,
				["傀儡主宰"] = 0,
				["暗影步"] = 0,
				["血雨"] = 0,
				["飞蝗之跃"] = 0,
				["生死簿"] = 0,
				["神圣洞察"] = 0,
				["强击光环"] = 0,
				["风歌"] = 0,
				["闪光红玉"] = 0,
				["不稳定的血清"] = 0,
				["战歌"] = 0,
				["猛虎之力"] = 0,
				["灵魂链接"] = 0,
				["踏风连击：幻灭踢"] = 0,
				["冰冷智慧"] = 0,
				["见招拆招"] = 0,
				["猛虎连击"] = 0,
				["亮纹"] = 0,
				["搜寻并摧毁"] = 0,
				["满天星"] = 0,
				["踏风连击：猛虎掌"] = 0,
				["寒冰指"] = 0,
				["焦灼真言"] = 0,
				["心灵尖刺雕文"] = 0,
				["黑暗涌动"] = 0,
				["天神祝福"] = 0,
				["闪现术"] = 0,
				["势如破竹"] = 0,
				["剑刃风暴"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"天使壁垒", -- [1]
				"身心合一", -- [2]
				"寒冰护体", -- [3]
				"冰冷智慧", -- [4]
				"风暴烈酒", -- [5]
				"强化翔龙", -- [6]
				"痛苦压制", -- [7]
				"真言术：韧", -- [8]
				"奥术光辉", -- [9]
				"寒冰屏障", -- [10]
				"操控时间", -- [11]
				"缓落术", -- [12]
				"疑心重重", -- [13]
			},
		},
		["PROFILE"] = {
		},
	},
}
