
TradeSkillMaster_AccountingDB = {
	["global"] = {
		["infoID"] = 1,
		["itemStrings"] = {
			["野雉胸肉"] = "item:74839:0:0:0:0:0:0",
			["罗杰斯船长的文明大棒"] = "item:90382:0:0:0:0:0:0",
			["峭岩之雕饰指环"] = "item:90904:0:0:0:0:0:-127",
			["石板之影火项链"] = "item:90905:0:0:0:0:0:-128",
			["皇紫晶"] = "item:76141:0:0:0:0:0:0",
			["恐怖南瓜头徽戒"] = "item:71330:0:0:0:0:0:0",
			["水晶瓶"] = "item:3371:0:0:0:0:0:0",
			["幽冥铁块"] = "item:72096:0:0:0:0:0:0",
			["水流之魂"] = "item:89641:0:0:0:0:0:0",
			["附魔手套 - 超级力量"] = "item:74721:0:0:0:0:0:0",
			["朱砂玛瑙"] = "item:76140:0:0:0:0:0:0",
			["延极锭"] = "item:72095:0:0:0:0:0:0",
			["活化钢"] = "item:72104:0:0:0:0:0:0",
			["炼金师的回春水"] = "item:76094:0:0:0:0:0:0",
			["炉石"] = "item:6948:0:0:0:0:0:0",
			["庆祝包裹"] = "item:71134:0:0:0:0:0:0",
			["源钻"] = "item:76132:0:0:0:0:0:0",
			["荒玉"] = "item:76139:0:0:0:0:0:0",
		},
	},
	["profileKeys"] = {
		["晴天小猫 - 阿拉索"] = "Default",
	},
	["factionrealm"] = {
		["Alliance - 阿拉索"] = {
			["itemData"] = {
				["buy"] = {
				},
				["sell"] = {
				},
			},
		},
	},
}
