
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"传送", -- [1]
				"火焰冲击", -- [2]
				"裂伤", -- [3]
				"炎爆术", -- [4]
				"献祭", -- [5]
				"暗言术：痛", -- [6]
				"活动炸弹", -- [7]
				"火焰绽放", -- [8]
				"击退", -- [9]
				"顺劈斩", -- [10]
				"尖牙撕咬", -- [11]
				"汹涌", -- [12]
				"恶毒之咬", -- [13]
				"击倒", -- [14]
				"灵魂燃烧", -- [15]
				"毁灭打击", -- [16]
				"活力诅咒", -- [17]
				"紫晶之池", -- [18]
				"跳跃冲击", -- [19]
				"利刃冲锋", -- [20]
				"投掷盾牌", -- [21]
				"毁灭", -- [22]
				"投掷", -- [23]
				"致死打击", -- [24]
				"暗影震击", -- [25]
				"破胆怒吼", -- [26]
				"导致疯狂", -- [27]
				"震山掌", -- [28]
				"精神鞭笞", -- [29]
				"穿刺护甲", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["filt"] = {
			},
			["buffer"] = {
				["致死打击"] = 0,
				["灵魂燃烧"] = 0,
				["跳跃冲击"] = 0,
				["炎爆术"] = 0,
				["击退"] = 0,
				["汹涌"] = 0,
				["毁灭打击"] = 0,
				["投掷盾牌"] = 0,
				["震山掌"] = 0,
				["活动炸弹"] = 0,
				["穿刺护甲"] = 0,
				["利刃冲锋"] = 0,
				["火焰绽放"] = 0,
				["精神鞭笞"] = 0,
				["投掷"] = 0,
				["活力诅咒"] = 0,
				["献祭"] = 0,
				["紫晶之池"] = 0,
				["破胆怒吼"] = 0,
				["裂伤"] = 0,
				["暗言术：痛"] = 0,
				["尖牙撕咬"] = 0,
				["恶毒之咬"] = 0,
				["顺劈斩"] = 0,
				["击倒"] = 0,
				["传送"] = 0,
				["导致疯狂"] = 0,
				["暗影震击"] = 0,
				["毁灭"] = 0,
				["火焰冲击"] = 0,
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"水栖形态", -- [1]
				"魔法反射", -- [2]
				"拉格纳罗斯的庇护", -- [3]
				"衰减魔法", -- [4]
				"地狱火", -- [5]
				"火焰绽放", -- [6]
				"激怒", -- [7]
				"狂乱", -- [8]
				"烟雾弹", -- [9]
				"炽热极速", -- [10]
				"巨魔冲锋", -- [11]
				"极速奥能", -- [12]
				"野火灌注", -- [13]
				"废灵壁垒", -- [14]
				"引导火焰", -- [15]
				"震中", -- [16]
				"真实形态", -- [17]
				"坚固的石头", -- [18]
				"固石光环", -- [19]
				"狂乱之护", -- [20]
				"投掷盾牌", -- [21]
				"熔火齐射", -- [22]
				"鲁莽鼓舞", -- [23]
				"钢铁保护者", -- [24]
				"毁灭", -- [25]
				"旋风斩", -- [26]
				"辐射能量", -- [27]
				"过载", -- [28]
				"不稳定的能量", -- [29]
				"能量导管", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["filt"] = {
			},
			["buffer"] = {
				["保护者显形"] = 0,
				["元素火焰"] = 0,
				["火球术"] = 0,
				["燃烧"] = 0,
				["投掷"] = 0,
				["星界气息"] = 0,
				["强化重塑"] = 0,
				["统御意志"] = 0,
				["旋风斩"] = 0,
				["地面猛击"] = 0,
				["魔爆术"] = 0,
				["聚焦能量"] = 0,
				["锤击"] = 0,
				["纯粹能量"] = 0,
				["震荡波"] = 0,
				["横扫千军"] = 0,
				["消沉巫术"] = 0,
				["火焰爆发"] = 0,
				["碎石"] = 0,
				["回旋风暴"] = 0,
				["闪电之拳"] = 0,
				["强力横扫"] = 0,
				["净化之焰"] = 0,
				["敲击"] = 0,
				["暗影箭"] = 0,
				["震中"] = 0,
				["黑暗治疗"] = 0,
				["引爆"] = 0,
				["电弧能量"] = 0,
				["鲁莽鼓舞"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["filt"] = {
			},
			["buffer"] = {
				["活动炸弹"] = 0,
				["敏捷思维"] = 0,
				["炎爆术"] = 0,
				["重伤"] = 0,
				["纯净之手"] = 0,
				["冰冻"] = 0,
				["炽热极速"] = 0,
				["冲击波"] = 0,
				["冷酷严冬"] = 0,
				["点燃"] = 0,
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"元素火焰", -- [1]
				"黑暗治疗", -- [2]
				"投掷", -- [3]
				"魔爆术", -- [4]
				"统御意志", -- [5]
				"暗影箭", -- [6]
				"引爆", -- [7]
				"震中", -- [8]
				"闪电之拳", -- [9]
				"碎石", -- [10]
				"地面猛击", -- [11]
				"火焰爆发", -- [12]
				"火球术", -- [13]
				"鲁莽鼓舞", -- [14]
				"净化之焰", -- [15]
				"消沉巫术", -- [16]
				"敲击", -- [17]
				"震荡波", -- [18]
				"回旋风暴", -- [19]
				"燃烧", -- [20]
				"旋风斩", -- [21]
				"锤击", -- [22]
				"横扫千军", -- [23]
				"聚焦能量", -- [24]
				"电弧能量", -- [25]
				"保护者显形", -- [26]
				"星界气息", -- [27]
				"强化重塑", -- [28]
				"纯粹能量", -- [29]
				"强力横扫", -- [30]
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["filt"] = {
			},
			["buffer"] = {
				["狂乱"] = 0,
				["辐射能量"] = 0,
				["地狱火"] = 0,
				["极速奥能"] = 0,
				["熔火齐射"] = 0,
				["拉格纳罗斯的庇护"] = 0,
				["投掷盾牌"] = 0,
				["过载"] = 0,
				["衰减魔法"] = 0,
				["旋风斩"] = 0,
				["坚固的石头"] = 0,
				["真实形态"] = 0,
				["火焰绽放"] = 0,
				["引导火焰"] = 0,
				["激怒"] = 0,
				["狂乱之护"] = 0,
				["野火灌注"] = 0,
				["固石光环"] = 0,
				["炽热极速"] = 0,
				["不稳定的能量"] = 0,
				["水栖形态"] = 0,
				["魔法反射"] = 0,
				["能量导管"] = 0,
				["震中"] = 0,
				["钢铁保护者"] = 0,
				["巨魔冲锋"] = 0,
				["废灵壁垒"] = 0,
				["烟雾弹"] = 0,
				["毁灭"] = 0,
				["鲁莽鼓舞"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"敏捷思维", -- [1]
				"冲击波", -- [2]
				"冰冻", -- [3]
				"炎爆术", -- [4]
				"冷酷严冬", -- [5]
				"点燃", -- [6]
				"活动炸弹", -- [7]
				"重伤", -- [8]
				"纯净之手", -- [9]
				"炽热极速", -- [10]
			},
		},
		["PROFILE"] = {
		},
	},
}
