
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"致死打击", -- [1]
				"暗影震击", -- [2]
				"破胆怒吼", -- [3]
				"导致疯狂", -- [4]
				"震山掌", -- [5]
				"精神鞭笞", -- [6]
				"穿刺护甲", -- [7]
				"上钩拳", -- [8]
				"重压打击", -- [9]
				"酸液喷射", -- [10]
				"痒", -- [11]
				"破甲", -- [12]
				"毒液箭", -- [13]
				"麻痹药膏", -- [14]
				"减速药膏", -- [15]
				"重伤", -- [16]
				"无力冲锋", -- [17]
				"破甲顺劈", -- [18]
				"击退", -- [19]
				"召唤玩家", -- [20]
				"头重脚轻", -- [21]
				"狂暴冲锋", -- [22]
				"击倒", -- [23]
				"顺劈斩", -- [24]
				"大地震击", -- [25]
				"捕猎时间", -- [26]
				"穿刺打击", -- [27]
				"螳螂军火爆炸", -- [28]
				"震颤", -- [29]
				"削弱护甲", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["filt"] = {
			},
			["buffer"] = {
				["精神鞭笞"] = 0,
				["头重脚轻"] = 0,
				["致死打击"] = 0,
				["重伤"] = 0,
				["震山掌"] = 0,
				["狂暴冲锋"] = 0,
				["大地震击"] = 0,
				["震颤"] = 0,
				["召唤玩家"] = 0,
				["捕猎时间"] = 0,
				["击退"] = 0,
				["上钩拳"] = 0,
				["减速药膏"] = 0,
				["穿刺打击"] = 0,
				["重压打击"] = 0,
				["麻痹药膏"] = 0,
				["破甲"] = 0,
				["螳螂军火爆炸"] = 0,
				["破胆怒吼"] = 0,
				["破甲顺劈"] = 0,
				["酸液喷射"] = 0,
				["导致疯狂"] = 0,
				["击倒"] = 0,
				["顺劈斩"] = 0,
				["无力冲锋"] = 0,
				["痒"] = 0,
				["削弱护甲"] = 0,
				["暗影震击"] = 0,
				["穿刺护甲"] = 0,
				["毒液箭"] = 0,
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"炎爆术！", -- [1]
				"热力迸发", -- [2]
				"快速冻结", -- [3]
				"寒冰护体", -- [4]
				"天神祝福", -- [5]
				"亮纹", -- [6]
				"天灾之握", -- [7]
				"天灾军旗光环", -- [8]
				"天灾军团旗帜携带者", -- [9]
				"虔诚光环", -- [10]
				"激流", -- [11]
				"战斗怒吼", -- [12]
				"先祖活力", -- [13]
				"潮汐奔涌", -- [14]
				"双子传送", -- [15]
				"变形包", -- [16]
				"爆炸", -- [17]
				"疯狂光环", -- [18]
				"Agro Drones", -- [19]
				"狂乱", -- [20]
				"旋风斩", -- [21]
				"复仇", -- [22]
				"大地之盾", -- [23]
				"风之优雅", -- [24]
				"燃烧之怒", -- [25]
				"风歌", -- [26]
				"狂暴", -- [27]
				"焦油", -- [28]
				"破碎的甲壳", -- [29]
				"密封甲壳", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["filt"] = {
			},
			["buffer"] = {
				["强效治疗术"] = 0,
				["沙尘爆裂"] = 0,
				["凝视"] = 0,
				["炎爆术"] = 0,
				["刺骨之箭"] = 0,
				["投掷雕像"] = 0,
				["强风冲击"] = 0,
				["火球"] = 0,
				["巨龙之息"] = 0,
				["焚烧书籍"] = 0,
				["光明之刃"] = 0,
				["横扫"] = 0,
				["心灵震爆"] = 0,
				["连珠火球"] = 0,
				["狂乱攻击"] = 0,
				["沉默"] = 0,
				["眼棱"] = 0,
				["尖啸虫群"] = 0,
				["充实"] = 0,
				["碳酸饱和"] = 0,
				["治疗波"] = 0,
				["践踏"] = 0,
				["治疗链"] = 0,
				["采矿"] = 0,
				["暗影箭"] = 0,
				["魔爆术"] = 0,
				["梦幻墨水"] = 0,
				["重击头槌"] = 0,
				["神圣之火"] = 0,
				["火球术"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["filt"] = {
			},
			["buffer"] = {
				["活动炸弹"] = 0,
				["敏捷思维"] = 0,
				["炎爆术"] = 0,
				["重伤"] = 0,
				["纯净之手"] = 0,
				["冰冻"] = 0,
				["炽热极速"] = 0,
				["冲击波"] = 0,
				["冷酷严冬"] = 0,
				["点燃"] = 0,
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"火球术", -- [1]
				"采矿", -- [2]
				"眼棱", -- [3]
				"沉默", -- [4]
				"沙尘爆裂", -- [5]
				"横扫", -- [6]
				"治疗波", -- [7]
				"治疗链", -- [8]
				"心灵震爆", -- [9]
				"暗影箭", -- [10]
				"强效治疗术", -- [11]
				"魔爆术", -- [12]
				"充实", -- [13]
				"梦幻墨水", -- [14]
				"践踏", -- [15]
				"凝视", -- [16]
				"尖啸虫群", -- [17]
				"狂乱攻击", -- [18]
				"重击头槌", -- [19]
				"强风冲击", -- [20]
				"巨龙之息", -- [21]
				"焚烧书籍", -- [22]
				"炎爆术", -- [23]
				"连珠火球", -- [24]
				"火球", -- [25]
				"投掷雕像", -- [26]
				"光明之刃", -- [27]
				"神圣之火", -- [28]
				"刺骨之箭", -- [29]
				"碳酸饱和", -- [30]
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["filt"] = {
			},
			["buffer"] = {
				["狂乱"] = 0,
				["激流"] = 0,
				["天灾军旗光环"] = 0,
				["虔诚光环"] = 0,
				["先祖活力"] = 0,
				["风歌"] = 0,
				["寒冰护体"] = 0,
				["狂暴"] = 0,
				["复仇"] = 0,
				["旋风斩"] = 0,
				["Agro Drones"] = 0,
				["焦油"] = 0,
				["天灾军团旗帜携带者"] = 0,
				["潮汐奔涌"] = 0,
				["双子传送"] = 0,
				["大地之盾"] = 0,
				["炎爆术！"] = 0,
				["密封甲壳"] = 0,
				["亮纹"] = 0,
				["天灾之握"] = 0,
				["风之优雅"] = 0,
				["破碎的甲壳"] = 0,
				["快速冻结"] = 0,
				["变形包"] = 0,
				["爆炸"] = 0,
				["热力迸发"] = 0,
				["天神祝福"] = 0,
				["燃烧之怒"] = 0,
				["战斗怒吼"] = 0,
				["疯狂光环"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"敏捷思维", -- [1]
				"冲击波", -- [2]
				"冰冻", -- [3]
				"炎爆术", -- [4]
				"冷酷严冬", -- [5]
				"点燃", -- [6]
				"活动炸弹", -- [7]
				"重伤", -- [8]
				"纯净之手", -- [9]
				"炽热极速", -- [10]
			},
		},
		["PROFILE"] = {
		},
	},
}
