
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["buffer"] = {
				"锯齿利刃", -- [1]
				"针刺", -- [2]
				"猛击", -- [3]
				"冲锋", -- [4]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["buffer"] = {
				["针刺"] = 0,
				["锯齿利刃"] = 0,
				["猛击"] = 0,
				["冲锋"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["buffer"] = {
				"格玛利火焰", -- [1]
				"潜行", -- [2]
				"热力迸发", -- [3]
				"冲锋", -- [4]
				"眼镜蛇打击", -- [5]
				"风中的书页", -- [6]
				"镜面瞄准镜", -- [7]
				"治疗宠物", -- [8]
				"狂轰滥炸", -- [9]
				"狩猎刺激", -- [10]
				"棘皮术", -- [11]
				"水泡护盾", -- [12]
				"席卷之风", -- [13]
				"发疯", -- [14]
				"剑刃乱舞", -- [15]
				"死亡召唤", -- [16]
				"恐惧复苏", -- [17]
				"剑刃风暴", -- [18]
				"不稳定的血清", -- [19]
				"能量符文", -- [20]
				"秩序之光", -- [21]
				"寒冰护体", -- [22]
				"搜寻并摧毁", -- [23]
				"就是现在！", -- [24]
				"风歌", -- [25]
				"血之怒", -- [26]
				"咔啡疯狂", -- [27]
				"咔啡冲刺", -- [28]
				"咔啡疲惫", -- [29]
				"咔啡刺激", -- [30]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["buffer"] = {
				["格玛利火焰"] = 0,
				["恐惧"] = 0,
				["席卷之风"] = 0,
				["泡沫"] = 0,
				["扔掷易爆之球"] = 0,
				["裂痕"] = 0,
				["恐惧打击"] = 0,
				["螳螂妖地雷"] = 0,
				["煞能箭"] = 0,
				["腐蚀树脂"] = 0,
				["专注腐蚀"] = 0,
				["射击"] = 0,
				["断肢"] = 0,
				["雷电的呼唤"] = 0,
				["鼓胀"] = 0,
				["掷玉"] = 0,
				["震地"] = 0,
				["胡萝卜吐息"] = 0,
				["水泡护盾"] = 0,
				["恐惧复苏"] = 0,
				["毁坏"] = 0,
				["酒雾之箭"] = 0,
				["死亡召唤"] = 0,
				["剑刃乱舞"] = 0,
				["刚毛倒刺"] = 0,
				["煞能震爆"] = 0,
				["风绒布卷"] = 0,
				["恶作剧"] = 0,
				["恐惧爪击"] = 0,
				["酒精炸药"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["buffer"] = {
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["buffer"] = {
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["buffer"] = {
				["能量符文"] = 0,
				["秩序之光"] = 0,
				["席卷之风"] = 0,
				["发疯"] = 0,
				["潜行"] = 0,
				["咔啡疯狂"] = 0,
				["咔啡疲惫"] = 0,
				["寒冰护体"] = 0,
				["咔啡刺激"] = 0,
				["血之怒"] = 0,
				["风歌"] = 0,
				["眼镜蛇打击"] = 0,
				["恐惧复苏"] = 0,
				["死亡召唤"] = 0,
				["剑刃风暴"] = 0,
				["不稳定的血清"] = 0,
				["棘皮术"] = 0,
				["冲锋"] = 0,
				["狩猎刺激"] = 0,
				["水泡护盾"] = 0,
				["搜寻并摧毁"] = 0,
				["治疗宠物"] = 0,
				["咔啡冲刺"] = 0,
				["狂轰滥炸"] = 0,
				["剑刃乱舞"] = 0,
				["镜面瞄准镜"] = 0,
				["热力迸发"] = 0,
				["就是现在！"] = 0,
				["格玛利火焰"] = 0,
				["风中的书页"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["buffer"] = {
				"格玛利火焰", -- [1]
				"雷电的呼唤", -- [2]
				"裂痕", -- [3]
				"螳螂妖地雷", -- [4]
				"断肢", -- [5]
				"刚毛倒刺", -- [6]
				"扔掷易爆之球", -- [7]
				"泡沫", -- [8]
				"水泡护盾", -- [9]
				"鼓胀", -- [10]
				"酒雾之箭", -- [11]
				"胡萝卜吐息", -- [12]
				"席卷之风", -- [13]
				"酒精炸药", -- [14]
				"震地", -- [15]
				"死亡召唤", -- [16]
				"剑刃乱舞", -- [17]
				"煞能箭", -- [18]
				"恐惧", -- [19]
				"专注腐蚀", -- [20]
				"恐惧爪击", -- [21]
				"风绒布卷", -- [22]
				"恐惧复苏", -- [23]
				"恐惧打击", -- [24]
				"煞能震爆", -- [25]
				"腐蚀树脂", -- [26]
				"毁坏", -- [27]
				"恶作剧", -- [28]
				"掷玉", -- [29]
				"射击", -- [30]
			},
			["filt"] = {
			},
		},
		["PROFILE"] = {
		},
	},
}
