
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"强攻", -- [1]
				"削弱护甲", -- [2]
				"缴械", -- [3]
				"痛苦诅咒", -- [4]
				"影袭", -- [5]
				"虚弱之触", -- [6]
				"黑暗顺劈", -- [7]
				"惊魂碎击", -- [8]
				"灭杀", -- [9]
				"毁灭暗影", -- [10]
				"灭杀之咬", -- [11]
				"法杖打击", -- [12]
				"暗影步", -- [13]
				"锯齿利刃", -- [14]
				"希克提克打击", -- [15]
				"穿刺打击", -- [16]
				"破坏", -- [17]
				"螳螂军火爆炸", -- [18]
				"蚀之琥珀", -- [19]
				"感染撕咬", -- [20]
				"脚踝撕咬", -- [21]
				"强力撕咬", -- [22]
				"暗影爪击", -- [23]
				"青龙猛袭", -- [24]
				"翔龙猛袭", -- [25]
				"锯齿劈斩", -- [26]
				"水泡喷溅", -- [27]
				"煞能尖啸", -- [28]
				"舞空脚", -- [29]
				"投掷火炬", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["filt"] = {
			},
			["buffer"] = {
				["希克提克打击"] = 0,
				["暗影爪击"] = 0,
				["影袭"] = 0,
				["灭杀"] = 0,
				["暗影步"] = 0,
				["锯齿利刃"] = 0,
				["脚踝撕咬"] = 0,
				["强力撕咬"] = 0,
				["煞能尖啸"] = 0,
				["痛苦诅咒"] = 0,
				["虚弱之触"] = 0,
				["青龙猛袭"] = 0,
				["穿刺打击"] = 0,
				["翔龙猛袭"] = 0,
				["投掷火炬"] = 0,
				["缴械"] = 0,
				["强攻"] = 0,
				["螳螂军火爆炸"] = 0,
				["蚀之琥珀"] = 0,
				["灭杀之咬"] = 0,
				["水泡喷溅"] = 0,
				["锯齿劈斩"] = 0,
				["毁灭暗影"] = 0,
				["感染撕咬"] = 0,
				["舞空脚"] = 0,
				["黑暗顺劈"] = 0,
				["削弱护甲"] = 0,
				["惊魂碎击"] = 0,
				["法杖打击"] = 0,
				["破坏"] = 0,
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"巨龙之息", -- [1]
				"敏捷思维", -- [2]
				"血色保护", -- [3]
				"光明之刃", -- [4]
				"狂暴之怒", -- [5]
				"解除护甲", -- [6]
				"重型护甲", -- [7]
				"烈焰风暴", -- [8]
				"盾牌屏障", -- [9]
				"狂信", -- [10]
				"生命传导", -- [11]
				"异端裁决", -- [12]
				"命令怒吼", -- [13]
				"血之契印", -- [14]
				"方阵防御", -- [15]
				"血性之怒", -- [16]
				"美味", -- [17]
				"渐燃之恨", -- [18]
				"怨恨之环", -- [19]
				"暗影之池", -- [20]
				"烟雾之刃", -- [21]
				"灭杀之咬", -- [22]
				"飓风腿", -- [23]
				"怒雷破", -- [24]
				"玉杖之护", -- [25]
				"招架姿态", -- [26]
				"百裂拳", -- [27]
				"灵魂过载", -- [28]
				"闪电吐息", -- [29]
				"充能灵魂", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["filt"] = {
			},
			["buffer"] = {
				["飞天脚"] = 0,
				["飓风腿"] = 0,
				["憎恨之握"] = 0,
				["炎爆术"] = 0,
				["神圣之火"] = 0,
				["再生"] = 0,
				["煞能尖刺"] = 0,
				["憎恨连射"] = 0,
				["烈焰风暴"] = 0,
				["巨龙之息"] = 0,
				["光明之刃"] = 0,
				["招架姿态"] = 0,
				["钢铁漩涡"] = 0,
				["连珠火球"] = 0,
				["火球术"] = 0,
				["刺骨之箭"] = 0,
				["火焰之花"] = 0,
				["火之球"] = 0,
				["召唤蚀心之怨"] = 0,
				["火球"] = 0,
				["粉碎护盾"] = 0,
				["神圣惩击"] = 0,
				["怒雷破"] = 0,
				["掌击"] = 0,
				["暗影箭"] = 0,
				["煞能震爆"] = 0,
				["投掷雕像"] = 0,
				["焚烧书籍"] = 0,
				["召唤法杖"] = 0,
				["百裂拳"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["filt"] = {
			},
			["buffer"] = {
				["刃舞"] = 0,
				["敏捷思维"] = 0,
				["暗影烈焰"] = 0,
				["重伤"] = 0,
				["腐蚀术"] = 0,
				["盲目之光"] = 0,
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"巨龙之息", -- [1]
				"焚烧书籍", -- [2]
				"炎爆术", -- [3]
				"连珠火球", -- [4]
				"火球", -- [5]
				"投掷雕像", -- [6]
				"光明之刃", -- [7]
				"烈焰风暴", -- [8]
				"火球术", -- [9]
				"神圣之火", -- [10]
				"神圣惩击", -- [11]
				"粉碎护盾", -- [12]
				"刺骨之箭", -- [13]
				"憎恨之握", -- [14]
				"召唤蚀心之怨", -- [15]
				"憎恨连射", -- [16]
				"暗影箭", -- [17]
				"煞能尖刺", -- [18]
				"再生", -- [19]
				"飓风腿", -- [20]
				"怒雷破", -- [21]
				"召唤法杖", -- [22]
				"火之球", -- [23]
				"钢铁漩涡", -- [24]
				"掌击", -- [25]
				"飞天脚", -- [26]
				"招架姿态", -- [27]
				"百裂拳", -- [28]
				"火焰之花", -- [29]
				"煞能震爆", -- [30]
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["filt"] = {
			},
			["buffer"] = {
				["飓风腿"] = 0,
				["敏捷思维"] = 0,
				["暗影之池"] = 0,
				["百裂拳"] = 0,
				["巨龙之息"] = 0,
				["盾牌屏障"] = 0,
				["渐燃之恨"] = 0,
				["血性之怒"] = 0,
				["烈焰风暴"] = 0,
				["解除护甲"] = 0,
				["光明之刃"] = 0,
				["招架姿态"] = 0,
				["血色保护"] = 0,
				["灭杀之咬"] = 0,
				["异端裁决"] = 0,
				["玉杖之护"] = 0,
				["怨恨之环"] = 0,
				["血之契印"] = 0,
				["狂暴之怒"] = 0,
				["狂信"] = 0,
				["方阵防御"] = 0,
				["生命传导"] = 0,
				["怒雷破"] = 0,
				["烟雾之刃"] = 0,
				["命令怒吼"] = 0,
				["灵魂过载"] = 0,
				["重型护甲"] = 0,
				["充能灵魂"] = 0,
				["闪电吐息"] = 0,
				["美味"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"敏捷思维", -- [1]
				"暗影烈焰", -- [2]
				"盲目之光", -- [3]
				"重伤", -- [4]
				"腐蚀术", -- [5]
				"刃舞", -- [6]
			},
		},
		["PROFILE"] = {
		},
	},
}
